package com.example.poems2;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.view.animation.AlphaAnimation;
import android.view.animation.Animation;
import android.widget.Button;
import android.widget.EditText;
import android.widget.ImageView;

public class Activity11 extends AppCompatActivity {


    public void animate(final String transl){

        final EditText editText = (EditText) findViewById(R.id.editText);
        final Button translateButton = (Button) findViewById(R.id.translateButton);
        final Animation in = new AlphaAnimation(0.0f, 1.0f);
        in.setDuration(1500);

        final Animation out = new AlphaAnimation(1.0f, 0.0f);
        out.setDuration(1500);

        out.setAnimationListener(new Animation.AnimationListener() {

            @Override
            public void onAnimationEnd(Animation animation) {
                editText.setText(transl);
                editText.startAnimation(in);
                translateButton.setEnabled(false);

            }
            public void onAnimationRepeat(Animation animation) {
                // TODO Auto-generated method stub
            }
            public void onAnimationStart(Animation animation) {
                // TODO Auto-generated method stub
            }
        });




        translateButton.setOnClickListener( new View.OnClickListener() {
            public void onClick(View v) {

                editText.startAnimation(out);

            }
        });


    }

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_11);

        final EditText editText = (EditText) findViewById(R.id.editText);

        ImageView imageView = (ImageView) findViewById(R.id.imageView);
        // Get the Intent that started this activity and extract the string
        Intent intent = getIntent();
        String message = intent.getStringExtra(MainActivity.EXTRA_MESSAGE);


        int messageInt = Integer.parseInt(message);

        String mainInfo = "";

        if (messageInt == 1)
        {

            imageView.setImageResource(R.drawable.pushkin1);
            final Button translateButton = (Button) findViewById(R.id.translateButton);


            final String transl = "К ***\n" +
                    "\n" +
                    "Я помню чудное мгновенье:\n" +
                    "Передо мной явилась ты,\n" +
                    "Как мимолетное виденье,\n" +
                    "Как гений чистой красоты.\n" +
                    "\n" +
                    "В томленьях грусти безнадежной\n" +
                    "В тревогах шумной суеты,\n" +
                    "Звучал мне долго голос нежный\n" +
                    "И снились милые черты.\n" +
                    "\n" +
                    "Шли годы. Бурь порыв мятежный\n" +
                    "Рассеял прежние мечты,\n" +
                    "И я забыл твой голос нежный,\n" +
                    "Твои небесные черты.\n" +
                    "\n" +
                    "В глуши, во мраке заточенья\n" +
                    "Тянулись тихо дни мои\n" +
                    "Без божества, без вдохновенья,\n" +
                    "Без слез, без жизни, без любви.\n" +
                    "\n" +
                    "Душе настало пробужденье:\n" +
                    "И вот опять явилась ты,\n" +
                    "Как мимолетное виденье,\n" +
                    "Как гений чистой красоты.\n" +
                    "\n" +
                    "И сердце бьется в упоенье,\n" +
                    "И для него воскресли вновь\n" +
                    "И божество, и вдохновенье,\n" +
                    "И жизнь, и слезы, и любовь. ";


            mainInfo = "To *** \n" +
                    "I still recall the wondrous moment\n" +
                    "When you appeared before my eyes, \n" +
                    "Just like a fleeting apparition,\n" +
                    "Just like pure beauty's distillation.\n" +
                    "\n" +
                    "When'er I languished in the throes of hopeless grief\n" +
                    "Amid the troubles of life's vanity,\n" +
                    "Your sweet voice lingered on in me,\n" +
                    "Your dear face came to me in dreams.\n" +
                    "\n" +
                    "Years passed. The raging, gusty storms\n" +
                    "Dispersed my former reveries,\n" +
                    "And I forgot your tender voice,\n" +
                    "Your features so divine.\n" +
                    "\n" +
                    "In exile, in confinement's gloom,\n" +
                    "My uneventful days wore on,\n" +
                    "Bereft of awe and inspiration\n" +
                    "Bereft of tears, of life, of love.\n" +
                    "\n" +
                    "My soul awakened once again:\n" +
                    "And once again you came to me,\n" +
                    "Just like a fleeting apparition\n" +
                    "Just like pure beauty's distillation.\n" +
                    "\n" +
                    "My heart again resounds in rapture,\n" +
                    "Within it once again arise\n" +
                    "Feelings of awe and inspiration,\n" +
                    "Of life itself, of tears, and love.";

            editText.setText(mainInfo);

            animate(transl);

        }

        if (messageInt == 2)
        {
            imageView.setImageResource(R.drawable.pushkin2);
            final Button translateButton = (Button) findViewById(R.id.translateButton);

            final String transl = "Я вас любил: любовь еще, быть может,\n" +
                    "В душе моей угасла не совсем;\n" +
                    "Но пусть она вас больше не тревожит;\n" +
                    "Я не хочу печалить вас ничем.\n" +
                    "\n" +
                    "Я вас любил безмолвно, безнадежно,\n" +
                    "То робостью, то ревностью томим;\n" +
                    "Я вас любил так искренно, так нежно,\n" +
                    "Как дай вам бог любимой быть другим. \n";


            mainInfo = "I loved you: and, it may be, from my soul\n" +
                    "The former love has never gone away,\n" +
                    "But let it not recall to you my dole;\n" +
                    "I wish not sadden you in any way. \n" +
                    "\n" +
                    "I loved you silently, without hope, fully,\n" +
                    "In diffidence, in jealousy, in pain;\n" +
                    "I loved you so tenderly and truly, \n" +
                    "As let you else be loved by any man. \n ";

            editText.setText(mainInfo);

            animate(transl);

        }
        if (messageInt == 3) {

            imageView.setImageResource(R.drawable.glodentrees);
            final String transl = "Отговорила роща золотая \n" +
                    "Березовым, веселым языком, \n" +
                    "И журавли, печально пролетая, \n" +
                    "Уж не жалеют больше ни о ком. \n" +
                    "\n" +
                    "Кого жалеть? Ведь каждый в мире странник — \n" +
                    "Пройдет, зайдет и вновь оставит дом. \n" +
                    "О всех ушедших грезит коноплянник \n" +
                    "С широким месяцем над голубым прудом. \n" +
                    "\n" +
                    "Стою один среди равнины голой, \n" +
                    "А журавлей относит ветер в даль, \n" +
                    "Я полон дум о юности веселой, \n" +
                    "Но ничего в прошедшем мне не жаль. \n" +
                    "\n" +
                    "Не жаль мне лет, растраченных напрасно, \n" +
                    "Не жаль души сиреневую цветь. \n" +
                    "В саду горит костер рябины красной, \n" +
                    "Но никого не может он согреть. \n" +
                    "\n" +
                    "Не обгорят рябиновые кисти, \n" +
                    "От желтизны не пропадет трава. \n" +
                    "Как дерево роняет тихо листья, \n" +
                    "Так я роняю грустные слова. \n" +
                    "\n" +
                    "И если время, ветром разметая, \n" +
                    "Сгребет их все в один ненужный ком… \n" +
                    "Скажите так… что роща золотая \n" +
                    "Отговорила милым языком. \n";


            mainInfo = "The golden birch -tree grove has fallen silent\n " +
                    "Its merry  chatter having  stopped afore,\n" +
                    "The cranes up there flying over, sullen,\n" +
                    "Have nobody to pity any more.\n" +
                    " \n" +
                    "Whom should they pity? Each is just a trotter.\n" +
                    "One comes and goes and leaves for good again.\n" +
                    "The moon  and  hempen  bush above the water\n" +
                    "Remember all those perished, filled with pain.\n" +
                    " \n" +
                    "I\"m standing on the plain all on my own,\n" +
                    "The cranes, the wind is taking them away,\n" +
                    "I think about my boyhood which  has flown,\n" +
                    "And I do not regret my bygones anyway.\n" +
                    " \n" +
                    "I don\"t regret the days that I discarded,\n" +
                    "I don\"t feel sorry for the lilac of my soul.\n" +
                    "The purple rowan burning  in the garden\n" +
                    "Can\"t warm and comfort anyone at all.\n" +
                    " \n" +
                    "The rowan will maintain its coloration.\n" +
                    "The grass exposed to heat will not decease,\n" +
                    "I drop my words of sorrow and vexation\n" +
                    "The way a tree drops quietly its leaves.\n" +
                    " \n" +
                    "And if some day   the wind of time intended\n" +
                    "To rake them all up in a useless roll...\n" +
                    "You ought to say:  the golden grove has ended\n" +
                    "Its lovely chatter in the prime of fall." +
                    "1924" ;

            editText.setText(mainInfo);

            animate(transl);
        }
        if (messageInt == 4)
        {

            imageView.setImageResource(R.drawable.esenin);

            final String transl = "До свиданья, друг мой, до свиданья. \n" +
                    "Милый мой, ты у меня в груди. \n" +
                    "Предназначенное расставанье \n" +
                    "Обещает встречу впереди. \n" +
                    "\n" +
                    "До свиданья, друг мой, без руки, без слова, \n" +
                    "Не грусти и не печаль бровей,- \n" +
                    "В этой жизни умирать не ново, \n" +
                    "Но и жить, конечно, не новей.";

            mainInfo = "Goodbye, my friend, goodbye.\n" +
                    "My dear, you are in my heart.\n" +
                    "Predestined separation\n" +
                    "Promises a future meeting.\n" +
                    "Goodbye, my friend, without handshake and words,\n" +
                    "Do not grieve and sadden your brow,-\n" +
                    "In this life there’s nothing new in dying,\n" +
                    "But nor, of course, is living any newer.";


            editText.setText(mainInfo);

            animate(transl);
        }

        if (messageInt == 5)
        {
            imageView.setImageResource(R.drawable.pushkin2);
            final String transl = "Я памятник себе воздвиг нерукотворный, \n" +
                    "К нему не зарастет народная тропа, \n" +
                    "Вознесся выше он главою непокорной \n" +
                    "Александрийского столпа. \n" +
                    "\n" +
                    "Нет, весь я не умру - душа в заветной лире \n" +
                    "Мой прах переживет и тленья убежит - \n" +
                    "И славен буду я, доколь в подлунном мире \n" +
                    "Жив будет хоть один пиит. \n" +
                    "\n" +
                    "Слух обо мне пройдет по всей Руси великой, \n" +
                    "И назовет меня всяк сущий в ней язык, \n" +
                    "И гордый внук славян, и финн, и ныне дикой \n" +
                    "Тунгус, и друг степей калмык. \n" +
                    "\n" +
                    "И долго буду тем любезен я народу, \n" +
                    "Что чувства добрые я лирой пробуждал, \n" +
                    "Что в мой жестокий век восславил я Свободу \n" +
                    "И милость к падшим призывал. \n" +
                    "\n" +
                    "Веленью божию, о муза, будь послушна, \n" +
                    "Обиды не страшась, не требуя венца, \n" +
                    "Хвалу и клевету приемли равнодушно \n" +
                    "И не оспоривай глупца.";

            mainInfo = "\n" +
                    "I've reared a monument not built by human hands.\n" +
                    "The public path to it cannot be overgrown.\n" +
                    "With insubmissive head far loftier it stands\n" +
                    "               Than Alexander's columned stone.\n" +
                    "\n" +
                    "No, I shall not all die. My soul in hallowed berth\n" +
                    "Of art shall brave decay and from my dust take wing,\n" +
                    "And I shall be renowned whilst on this mortal earth\n" +
                    "               Even one poet lives to sing.\n" +
                    "\n" +
                    "Tidings of me shall spread through all the realm of Rus\n" +
                    "And every tribe in Her shall name me as they speak:\n" +
                    "The haughty western Pole, the east's untamed Tungus,\n" +
                    "               North Finns and the south steppe's Kalmyk.\n" +
                    "\n" +
                    "And long shall I a man dear to the people be\n" +
                    "For how my lyre once quickened kindly sentiment,\n" +
                    "I in a tyrant age who sang of liberty,\n" +
                    "               And mercy toward fallen men.\n" +
                    "\n" +
                    "To God and his commands pay Thou good heed, O Muse.\n" +
                    "To praise and slander both be nonchalant and cool.\n" +
                    "Demand no laureate's wreath, think nothing of abuse,\n" +
                    "               And never argue with a fool.\n";

            editText.setText(mainInfo);

            animate(transl);
        }
        if (messageInt == 6) {

            imageView.setImageResource(R.drawable.saltan1);
            final String transl = "Три девицы под окном\n" +
                    "Пряли поздно вечерком.\n" +
                    "«Кабы я была царица, —\n" +
                    "Говорит одна девица, —\n" +
                    "5 То на весь крещеный мир\n" +
                    "Приготовила б я пир».\n" +
                    "«Кабы я была царица, —\n" +
                    "Говорит её сестрица, —\n" +
                    "То на весь бы мир одна\n" +
                    "10 Наткала я полотна».\n" +
                    "«Кабы я была царица, —\n" +
                    "Третья молвила сестрица, —\n" +
                    "Я б для батюшки-царя\n" +
                    "Родила богатыря».\n" +
                    "\n" +
                    "15 Только вымолвить успела,\n" +
                    "Дверь тихонько заскрыпела,\n" +
                    "И в светлицу входит царь,\n" +
                    "Стороны той государь.\n" +
                    "Во всё время разговора\n" +
                    "20 Он стоял позадь забора;\n" +
                    "Речь последней по всему\n" +
                    "Полюбилася ему.\n" +
                    "«Здравствуй, красная девица, —\n" +
                    "Говорит он, — будь царица\n" +
                    "25 И роди богатыря\n" +
                    "Мне к исходу сентября.\n" +
                    "Вы ж, голубушки-сестрицы,\n" +
                    "Выбирайтесь из светлицы,\n" +
                    "Поезжайте вслед за мной,\n" +
                    "30 Вслед за мной и за сестрой:\n" +
                    "Будь одна из вас ткачиха,\n" +
                    "А другая повариха».\n" +
                    "\n" +
                    "В сени вышел царь-отец.\n" +
                    "Все пустились во дворец.\n" +
                    "35 Царь недолго собирался:\n" +
                    "В тот же вечер обвенчался.\n" +
                    "Царь Салтан за пир честной\n" +
                    "Сел с царицей молодой;\n" +
                    "А потом честные гости\n" +
                    "40 На кровать слоновой кости\n" +
                    "Положили молодых\n" +
                    "И оставили одних.\n" +
                    "В кухне злится повариха,\n" +
                    "Плачет у станка ткачиха,\n" +
                    "45 И завидуют оне\n" +
                    "Государевой жене.\n" +
                    "А царица молодая,\n" +
                    "Дела вдаль не отлагая,\n" +
                    "С первой ночи понесла.\n" +
                    "\n" +
                    "50 В те поры война была.\n" +
                    "Царь Салтан, с женой простяся,\n" +
                    "На добра-коня садяся,\n" +
                    "Ей наказывал себя\n" +
                    "Поберечь, его любя.\n" +
                    "55 Между тем, как он далёко\n" +
                    "Бьётся долго и жестоко,\n" +
                    "Наступает срок родин;\n" +
                    "Сына бог им дал в аршин,\n" +
                    "И царица над ребёнком\n" +
                    "60 Как орлица над орлёнком;\n" +
                    "Шлёт с письмом она гонца,\n" +
                    "Чтоб обрадовать отца.\n" +
                    "А ткачиха с поварихой,\n" +
                    "С сватьей бабой Бабарихой,\n" +
                    "65 Извести её хотят,\n" +
                    "Перенять гонца велят;\n" +
                    "Сами шлют гонца другого\n" +
                    "Вот с чем от слова до слова:\n" +
                    "«Родила царица в ночь\n" +
                    "70 Не то сына, не то дочь;\n" +
                    "Не мышонка, не лягушку,\n" +
                    "А неведому зверюшку».\n" +
                    "\n" +
                    "Как услышал царь-отец,\n" +
                    "Что донес ему гонец,\n" +
                    "75 В гневе начал он чудесить\n" +
                    "И гонца хотел повесить;\n" +
                    "Но, смягчившись на сей раз,\n" +
                    "Дал гонцу такой приказ:\n" +
                    "«Ждать царёва возвращенья\n" +
                    "80 Для законного решенья».\n" +
                    "\n" +
                    "Едет с грамотой гонец,\n" +
                    "И приехал наконец.\n" +
                    "А ткачиха с поварихой,\n" +
                    "С сватьей бабой Бабарихой,\n" +
                    "85 Обобрать его велят;\n" +
                    "Допьяна гонца поят\n" +
                    "И в суму его пустую\n" +
                    "Суют грамоту другую —\n" +
                    "И привёз гонец хмельной\n" +
                    "90 В тот же день приказ такой:\n" +
                    "«Царь велит своим боярам,\n" +
                    "Времени не тратя даром,\n" +
                    "И царицу и приплод\n" +
                    "Тайно бросить в бездну вод».\n" +
                    "95 Делать нечего: бояре,\n" +
                    "Потужив о государе\n" +
                    "И царице молодой,\n" +
                    "В спальню к ней пришли толпой.\n" +
                    "Объявили царску волю —\n" +
                    "100 Ей и сыну злую долю,\n" +
                    "Прочитали вслух указ,\n" +
                    "И царицу в тот же час\n" +
                    "В бочку с сыном посадили,\n" +
                    "Засмолили, покатили\n" +
                    "105 И пустили в Окиян —\n" +
                    "Так велел-де царь Салтан.\n" +
                    "\n" +
                    "В синем небе звёзды блещут,\n" +
                    "В синем море волны хлещут;\n" +
                    "Туча по небу идет,\n" +
                    "110 Бочка по морю плывет.\n" +
                    "Словно горькая вдовица,\n" +
                    "Плачет, бьётся в ней царица;\n" +
                    "И растет ребёнок там\n" +
                    "Не по дням, а по часам.\n" +
                    "115 День прошёл, царица вопит…\n" +
                    "А дитя волну торопит:\n" +
                    "«Ты, волна моя, волна!\n" +
                    "Ты гульлива и вольна;\n" +
                    "Плещешь ты, куда захочешь,\n" +
                    "120 Ты морские камни точишь,\n" +
                    "Топишь берег ты земли,\n" +
                    "Подымаешь корабли —\n" +
                    "Не губи ты нашу душу:\n" +
                    "Выплесни ты нас на сушу!»\n" +
                    "125 И послушалась волна:\n" +
                    "Тут же на берег она\n" +
                    "Бочку вынесла легонько\n" +
                    "И отхлынула тихонько.\n" +
                    "Мать с младенцем спасена;\n" +
                    "130 Землю чувствует она.\n" +
                    "Но из бочки кто их вынет?\n" +
                    "Бог неужто их покинет?\n" +
                    "Сын на ножки поднялся,\n" +
                    "В дно головкой уперся,\n" +
                    "135 Понатужился немножко:\n" +
                    "«Как бы здесь на двор окошко\n" +
                    "Нам проделать?» — молвил он,\n" +
                    "Вышиб дно и вышел вон.\n" +
                    "\n" +
                    "Мать и сын теперь на воле;\n" +
                    "140 Видят холм в широком поле,\n" +
                    "Море синее кругом,\n" +
                    "Дуб зеленый над холмом.\n" +
                    "Сын подумал: добрый ужин\n" +
                    "Был бы нам, однако, нужен.\n" +
                    "145 Ломит он у дуба сук\n" +
                    "И в тугой сгибает лук,\n" +
                    "Со креста снурок шелковый\n" +
                    "Натянул на лук дубовый,\n" +
                    "Тонку тросточку сломил,\n" +
                    "150 Стрелкой легкой завострил\n" +
                    "И пошёл на край долины\n" +
                    "У моря искать дичины.\n" +
                    "\n" +
                    "К морю лишь подходит он,\n" +
                    "Вот и слышит будто стон…\n" +
                    "155 Видно на́ море не тихо;\n" +
                    "Смотрит — видит дело лихо:\n" +
                    "Бьётся лебедь средь зыбей,\n" +
                    "Коршун носится над ней;\n" +
                    "Та бедняжка так и плещет,\n" +
                    "160 Воду вкруг мутит и хлещет…\n" +
                    "Тот уж когти распустил,\n" +
                    "Клёв кровавый навострил…\n" +
                    "Но как раз стрела запела,\n" +
                    "В шею коршуна задела —\n" +
                    "165 Коршун в море кровь пролил,\n" +
                    "Лук царевич опустил;\n" +
                    "Смотрит: коршун в море тонет\n" +
                    "И не птичьим криком стонет,\n" +
                    "Лебедь около плывет,\n" +
                    "170 Злого коршуна клюет,\n" +
                    "Гибель близкую торопит,\n" +
                    "Бьёт крылом и в море топит —\n" +
                    "И царевичу потом\n" +
                    "Молвит русским языком:\n" +
                    "175 «Ты, царевич, мой спаситель,\n" +
                    "Мой могучий избавитель,\n" +
                    "Не тужи, что за меня\n" +
                    "Есть не будешь ты три дня,\n" +
                    "Что стрела пропала в море;\n" +
                    "180 Это горе — всё не горе.\n" +
                    "Отплачу тебе добром,\n" +
                    "Сослужу тебе потом:\n" +
                    "Ты не лебедь ведь избавил,\n" +
                    "Девицу в живых оставил;\n" +
                    "185 Ты не коршуна убил,\n" +
                    "Чародея подстрелил.\n" +
                    "Ввек тебя я не забуду:\n" +
                    "Ты найдешь меня повсюду,\n" +
                    "А теперь ты воротись,\n" +
                    "190 Не горюй и спать ложись».\n" +
                    "\n" +
                    "Улетела лебедь-птица,\n" +
                    "А царевич и царица,\n" +
                    "Целый день проведши так,\n" +
                    "Лечь решились на тощак.\n" +
                    "195 Вот открыл царевич очи;\n" +
                    "Отрясая грёзы ночи\n" +
                    "И дивясь, перед собой\n" +
                    "Видит город он большой,\n" +
                    "Стены с частыми зубцами,\n" +
                    "200 И за белыми стенами\n" +
                    "Блещут маковки церквей\n" +
                    "И святых монастырей.\n" +
                    "Он скорей царицу будит;\n" +
                    "Та как ахнет!.. «То ли будет? —\n" +
                    "205 Говорит он, — вижу я:\n" +
                    "Лебедь тешится моя».\n" +
                    "Мать и сын идут ко граду.\n" +
                    "Лишь ступили за ограду,\n" +
                    "Оглушительный трезвон\n" +
                    "210 Поднялся со всех сторон:\n" +
                    "К ним народ навстречу валит,\n" +
                    "Хор церковный бога хвалит;\n" +
                    "В колымагах золотых\n" +
                    "Пышный двор встречает их;\n" +
                    "215 Все их громко величают\n" +
                    "И царевича венчают\n" +
                    "Княжей шапкой, и главой\n" +
                    "Возглашают над собой;\n" +
                    "И среди своей столицы,\n" +
                    "220 С разрешения царицы,\n" +
                    "В тот же день стал княжить он\n" +
                    "И нарёкся: князь Гвидон.\n" +
                    "\n" +
                    "Ветер на море гуляет\n" +
                    "И кораблик подгоняет;\n" +
                    "225 Он бежит себе в волнах\n" +
                    "На раздутых парусах.\n" +
                    "Корабельщики дивятся,\n" +
                    "На кораблике толпятся,\n" +
                    "На знакомом острову\n" +
                    "230 Чудо видят наяву:\n" +
                    "Город новый златоглавый,\n" +
                    "Пристань с крепкою заставой;\n" +
                    "Пушки с пристани палят,\n" +
                    "Кораблю пристать велят.\n" +
                    "235 Пристают к заставе гости;\n" +
                    "Князь Гвидон зовёт их в гости,\n" +
                    "Их он кормит и поит\n" +
                    "И ответ держать велит:\n" +
                    "«Чем вы, гости, торг ведёте\n" +
                    "240 И куда теперь плывёте?»\n" +
                    "Корабельщики в ответ:\n" +
                    "«Мы объехали весь свет,\n" +
                    "Торговали соболями,\n" +
                    "Чернобурыми лисами;\n" +
                    "245 А теперь нам вышел срок,\n" +
                    "Едем прямо на восток,\n" +
                    "Мимо острова Буяна,\n" +
                    "В царство славного Салтана…»\n" +
                    "Князь им вымолвил тогда:\n" +
                    "250 «Добрый путь вам, господа,\n" +
                    "По морю по Окияну\n" +
                    "К славному царю Салтану;\n" +
                    "От меня ему поклон».\n" +
                    "Гости в путь, а князь Гвидон\n" +
                    "255 С берега душой печальной\n" +
                    "Провожает бег их дальный;\n" +
                    "Глядь — поверх текучих вод\n" +
                    "Лебедь белая плывет.\n" +
                    "«Здравствуй, князь ты мой прекрасный!\n" +
                    "260 Что ты тих, как день ненастный?\n" +
                    "Опечалился чему?» —\n" +
                    "Говорит она ему.\n" +
                    "Князь печально отвечает:\n" +
                    "«Грусть-тоска меня съедает,\n" +
                    "265 Одолела молодца:\n" +
                    "Видеть я б хотел отца».\n" +
                    "Лебедь князю: «Вот в чём горе!\n" +
                    "Ну, послушай: хочешь в море\n" +
                    "Полететь за кораблем?\n" +
                    "270 Будь же, князь, ты комаром».\n" +
                    "И крылами замахала,\n" +
                    "Воду с шумом расплескала\n" +
                    "И обрызгала его\n" +
                    "С головы до ног всего.\n" +
                    "275 Тут он в точку уменьшился,\n" +
                    "Комаром оборотился,\n" +
                    "Полетел и запищал,\n" +
                    "Судно на море догнал,\n" +
                    "Потихоньку опустился\n" +
                    "280 На корабль — и в щель забился.\n" +
                    "\n" +
                    "Ветер весело шумит,\n" +
                    "Судно весело бежит\n" +
                    "Мимо острова Буяна,\n" +
                    "К царству славного Салтана,\n" +
                    "285 И желанная страна\n" +
                    "Вот уж издали видна.\n" +
                    "Вот на берег вышли гости;\n" +
                    "Царь Салтан зовёт их в гости,\n" +
                    "И за ними во дворец\n" +
                    "290 Полетел наш удалец.\n" +
                    "Видит: весь сияя в злате,\n" +
                    "Царь Салтан сидит в палате\n" +
                    "На престоле и в венце\n" +
                    "С грустной думой на лице;\n" +
                    "295 А ткачиха с поварихой,\n" +
                    "С сватьей бабой Бабарихой,\n" +
                    "Около царя сидят\n" +
                    "И в глаза ему глядят.\n" +
                    "Царь Салтан гостей сажает\n" +
                    "300 За свой стол и вопрошает:\n" +
                    "«Ой вы, гости-господа,\n" +
                    "Долго ль ездили? куда?\n" +
                    "Ладно ль за морем, иль худо?\n" +
                    "И какое в свете чудо?»\n" +
                    "305 Корабельщики в ответ:\n" +
                    "«Мы объехали весь свет;\n" +
                    "За морем житьё не худо,\n" +
                    "В свете ж вот какое чудо:\n" +
                    "В море остров был крутой,\n" +
                    "320 Не привальный, не жилой;\n" +
                    "Он лежал пустой равниной;\n" +
                    "Рос на нем дубок единый;\n" +
                    "А теперь стоит на нем\n" +
                    "Новый город со дворцом,\n" +
                    "325 С златоглавыми церквами,\n" +
                    "С теремами и садами,\n" +
                    "А сидит в нем князь Гвидон;\n" +
                    "Он прислал тебе поклон».\n" +
                    "Царь Салтан дивится чуду;\n" +
                    "330 Молвит он: «Коль жив я буду,\n" +
                    "Чудный остров навещу,\n" +
                    "У Гвидона погощу».\n" +
                    "А ткачиха с поварихой,\n" +
                    "С сватьей бабой Бабарихой,\n" +
                    "335 Не хотят его пустить\n" +
                    "Чудный остров навестить.\n" +
                    "«Уж диковинка, ну право, —\n" +
                    "Подмигнув другим лукаво,\n" +
                    "Повариха говорит, —\n" +
                    "340 Город у моря стоит!\n" +
                    "Знайте, вот что не безделка:\n" +
                    "Ель в лесу, под елью белка,\n" +
                    "Белка песенки поёт\n" +
                    "И орешки всё грызёт,\n" +
                    "345 А орешки не простые,\n" +
                    "Всё скорлупки золотые,\n" +
                    "Ядра — чистый изумруд;\n" +
                    "Вот что чудом-то зовут».\n" +
                    "Чуду царь Салтан дивится,\n" +
                    "350 А комар-то злится, злится —\n" +
                    "И впился комар как раз\n" +
                    "Тетке прямо в правый глаз.\n" +
                    "Повариха побледнела,\n" +
                    "Обмерла и окривела.\n" +
                    "355 Слуги, сватья и сестра\n" +
                    "С криком ловят комара.\n" +
                    "«Распроклятая ты мошка!\n" +
                    "Мы тебя!..» А он в окошко,\n" +
                    "Да спокойно в свой удел\n" +
                    "360 Через море полетел.\n" +
                    "\n" +
                    "Снова князь у моря ходит,\n" +
                    "С синя моря глаз не сводит;\n" +
                    "Глядь — поверх текучих вод\n" +
                    "365 Лебедь белая плывёт.\n" +
                    "«Здравствуй, князь ты мой прекрасный!\n" +
                    "Что ж ты тих, как день ненастный?\n" +
                    "Опечалился чему?» —\n" +
                    "Говорит она ему.\n" +
                    "370 Князь Гвидон ей отвечает:\n" +
                    "«Грусть-тоска меня съедает;\n" +
                    "Чудо чудное завесть\n" +
                    "Мне б хотелось. Где-то есть\n" +
                    "Ель в лесу, под елью белка;\n" +
                    "375 Диво, право, не безделка —\n" +
                    "Белка песенки поёт,\n" +
                    "Да орешки всё грызёт,\n" +
                    "А орешки не простые,\n" +
                    "Всё скорлупки золотые,\n" +
                    "380 Ядра — чистый изумруд;\n" +
                    "Но, быть может, люди врут».\n" +
                    "Князю лебедь отвечает:\n" +
                    "«Свет о белке правду бает;\n" +
                    "Это чудо знаю я;\n" +
                    "385 Полно, князь, душа моя,\n" +
                    "Не печалься; рада службу\n" +
                    "Оказать тебе я в дружбу».\n" +
                    "С ободрённою душой\n" +
                    "Князь пошел себе домой;\n" +
                    "390 Лишь ступил на двор широкий —\n" +
                    "Что ж? под ёлкою высокой,\n" +
                    "Видит, белочка при всех\n" +
                    "Золотой грызет орех,\n" +
                    "Изумрудец вынимает,\n" +
                    "395 А скорлупку собирает,\n" +
                    "Кучки равные кладёт\n" +
                    "И с присвисточкой поёт\n" +
                    "При честном при всём народе:\n" +
                    "Во саду ли, в огороде.\n" +
                    "400 Изумился князь Гвидон.\n" +
                    "«Ну, спасибо, — молвил он, —\n" +
                    "Ай да лебедь — дай ей боже,\n" +
                    "Что и мне, веселье то же».\n" +
                    "Князь для белочки потом\n" +
                    "405 Выстроил хрустальный дом,\n" +
                    "Караул к нему приставил\n" +
                    "И притом дьяка заставил\n" +
                    "Строгий счёт орехам весть.\n" +
                    "Князю прибыль, белке честь.\n" +
                    "\n" +
                    "410 Ветер по морю гуляет\n" +
                    "И кораблик подгоняет;\n" +
                    "Он бежит себе в волнах\n" +
                    "На поднятых парусах\n" +
                    "Мимо острова крутого,\n" +
                    "415 Мимо города большого:\n" +
                    "Пушки с пристани палят,\n" +
                    "Кораблю пристать велят.\n" +
                    "Пристают к заставе гости;\n" +
                    "Князь Гвидон зовёт их в гости,\n" +
                    "420 Их и кормит и поит\n" +
                    "И ответ держать велит:\n" +
                    "«Чем вы, гости, торг ведёте\n" +
                    "И куда теперь плывёте?»\n" +
                    "Корабельщики в ответ:\n" +
                    "425 «Мы объехали весь свет,\n" +
                    "Торговали мы конями,\n" +
                    "Всё донскими жеребцами,\n" +
                    "А теперь нам вышел срок —\n" +
                    "И лежит нам путь далёк:\n" +
                    "430 Мимо острова Буяна,\n" +
                    "В царство славного Салтана…»\n" +
                    "Говорит им князь тогда:\n" +
                    "«Добрый путь вам, господа,\n" +
                    "По морю по Окияну\n" +
                    "435 К славному царю Салтану;\n" +
                    "Да скажите: князь Гвидон\n" +
                    "Шлёт царю-де свой поклон».\n" +
                    "\n" +
                    "Гости князю поклонились,\n" +
                    "Вышли вон и в путь пустились.\n" +
                    "440 К морю князь — а лебедь там\n" +
                    "Уж гуляет по волнам.\n" +
                    "Молит князь: душа-де просит,\n" +
                    "Так и тянет и уносит…\n" +
                    "Вот опять она его\n" +
                    "445 Вмиг обрызгала всего:\n" +
                    "В муху князь оборотился,\n" +
                    "Полетел и опустился\n" +
                    "Между моря и небес\n" +
                    "На корабль — и в щель залез.\n" +
                    "\n" +
                    "450 Ветер весело шумит,\n" +
                    "Судно весело бежит\n" +
                    "Мимо острова Буяна,\n" +
                    "В царство славного Салтана —\n" +
                    "И желанная страна\n" +
                    "455 Вот уж издали видна;\n" +
                    "Вот на берег вышли гости;\n" +
                    "Царь Салтан зовёт их в гости,\n" +
                    "И за ними во дворец\n" +
                    "Полетел наш удалец.\n" +
                    "460 Видит: весь сияя в злате,\n" +
                    "Царь Салтан сидит в палате\n" +
                    "На престоле и в венце,\n" +
                    "С грустной думой на лице.\n" +
                    "А ткачиха с Бабарихой\n" +
                    "465 Да с кривою поварихой\n" +
                    "Около царя сидят,\n" +
                    "Злыми жабами глядят.\n" +
                    "Царь Салтан гостей сажает\n" +
                    "За свой стол и вопрошает:\n" +
                    "470 «Ой вы, гости-господа,\n" +
                    "Долго ль ездили? куда?\n" +
                    "Ладно ль за морем, иль худо,\n" +
                    "И какое в свете чудо?»\n" +
                    "Корабельщики в ответ:\n" +
                    "475 «Мы объехали весь свет;\n" +
                    "За морем житьё не худо;\n" +
                    "В свете ж вот какое чудо:\n" +
                    "Остров на море лежит,\n" +
                    "Град на острове стоит\n" +
                    "480 С златоглавыми церквами,\n" +
                    "С теремами да садами;\n" +
                    "Ель растет перед дворцом,\n" +
                    "А под ней хрустальный дом;\n" +
                    "Белка там живет ручная,\n" +
                    "485 Да затейница какая!\n" +
                    "Белка песенки поёт,\n" +
                    "Да орешки всё грызёт,\n" +
                    "А орешки не простые,\n" +
                    "Всё скорлупки золотые,\n" +
                    "490 Ядра — чистый изумруд;\n" +
                    "Слуги белку стерегут,\n" +
                    "Служат ей прислугой разной —\n" +
                    "И приставлен дьяк приказный\n" +
                    "Строгий счет орехам весть;\n" +
                    "495 Отдает ей войско честь;\n" +
                    "Из скорлупок льют монету,\n" +
                    "Да пускают в ход по свету;\n" +
                    "Девки сыплют изумруд\n" +
                    "В кладовые, да под спуд;\n" +
                    "500 Все в том острове богаты,\n" +
                    "Изоб нет, везде палаты;\n" +
                    "А сидит в нем князь Гвидон;\n" +
                    "Он прислал тебе поклон».\n" +
                    "Царь Салтан дивится чуду.\n" +
                    "505 «Если только жив я буду,\n" +
                    "Чудный остров навещу,\n" +
                    "У Гвидона погощу».\n" +
                    "А ткачиха с поварихой,\n" +
                    "С сватьей бабой Бабарихой,\n" +
                    "510 Не хотят его пустить\n" +
                    "Чудный остров навестить.\n" +
                    "Усмехнувшись исподтиха,\n" +
                    "Говорит царю ткачиха:\n" +
                    "«Что тут дивного? ну, вот!\n" +
                    "515 Белка камушки грызёт,\n" +
                    "Мечет золото и в груды\n" +
                    "Загребает изумруды;\n" +
                    "Этим нас не удивишь,\n" +
                    "Правду ль, нет ли говоришь.\n" +
                    "520 В свете есть иное диво:\n" +
                    "Море вздуется бурливо,\n" +
                    "Закипит, подымет вой,\n" +
                    "Хлынет на берег пустой,\n" +
                    "Разольётся в шумном беге,\n" +
                    "525 И очутятся на бреге,\n" +
                    "В чешуе, как жар горя,\n" +
                    "Тридцать три богатыря,\n" +
                    "Все красавцы удалые,\n" +
                    "Великаны молодые,\n" +
                    "530 Все равны, как на подбор,\n" +
                    "С ними дядька Черномор.\n" +
                    "Это диво, так уж диво,\n" +
                    "Можно молвить справедливо!»\n" +
                    "Гости умные молчат,\n" +
                    "535 Спорить с нею не хотят.\n" +
                    "Диву царь Салтан дивится,\n" +
                    "А Гвидон-то злится, злится…\n" +
                    "Зажужжал он и как раз\n" +
                    "Тётке сел на левый глаз,\n" +
                    "540 И ткачиха побледнела:\n" +
                    "«Ай!» и тут же окривела;\n" +
                    "Все кричат: «Лови, лови,\n" +
                    "Да дави её, дави…\n" +
                    "Вот ужо! постой немножко,\n" +
                    "545 Погоди…» А князь в окошко,\n" +
                    "Да спокойно в свой удел\n" +
                    "Через море прилетел.\n" +
                    "\n" +
                    "Князь у синя моря ходит,\n" +
                    "С синя моря глаз не сводит;\n" +
                    "550 Глядь — поверх текучих вод\n" +
                    "Лебедь белая плывёт.\n" +
                    "«Здравствуй, князь ты мой прекрасный!\n" +
                    "Что ты тих, как день ненастный?\n" +
                    "Опечалился чему?» —\n" +
                    "555 Говорит она ему.\n" +
                    "Князь Гвидон ей отвечает:\n" +
                    "«Грусть-тоска меня съедает —\n" +
                    "Диво б дивное хотел\n" +
                    "Перенесть я в мой удел».\n" +
                    "560 «А какое ж это диво?»\n" +
                    "— Где-то вздуется бурливо\n" +
                    "Окиян, подымет вой,\n" +
                    "Хлынет на берег пустой,\n" +
                    "Расплеснется в шумном беге,\n" +
                    "565 И очутятся на бреге,\n" +
                    "В чешуе, как жар горя,\n" +
                    "Тридцать три богатыря,\n" +
                    "Все красавцы молодые,\n" +
                    "Великаны удалые,\n" +
                    "570 Все равны, как на подбор,\n" +
                    "С ними дядька Черномор.\n" +
                    "Князю лебедь отвечает:\n" +
                    "«Вот что, князь, тебя смущает?\n" +
                    "Не тужи, душа моя,\n" +
                    "575 Это чудо знаю я.\n" +
                    "Эти витязи морские\n" +
                    "Мне ведь братья все родные.\n" +
                    "Не печалься же, ступай,\n" +
                    "В гости братцев поджидай».\n" +
                    "\n" +
                    "580 Князь пошёл, забывши горе,\n" +
                    "Сел на башню, и на море\n" +
                    "Стал глядеть он; море вдруг\n" +
                    "Всколыхалося вокруг,\n" +
                    "Расплескалось в шумном беге\n" +
                    "585 И оставило на бреге\n" +
                    "Тридцать три богатыря;\n" +
                    "В чешуе, как жар горя,\n" +
                    "Идут витязи четами,\n" +
                    "И, блистая сединами,\n" +
                    "590 Дядька впереди идёт\n" +
                    "И ко граду их ведёт.\n" +
                    "С башни князь Гвидон сбегает,\n" +
                    "Дорогих гостей встречает;\n" +
                    "Второпях народ бежит;\n" +
                    "595 Дядька князю говорит:\n" +
                    "«Лебедь нас к тебе послала\n" +
                    "И наказом наказала\n" +
                    "Славный город твой хранить\n" +
                    "И дозором обходить.\n" +
                    "600 Мы отныне ежеденно\n" +
                    "Вместе будем непременно\n" +
                    "У высоких стен твоих\n" +
                    "Выходить из вод морских,\n" +
                    "Так увидимся мы вскоре,\n" +
                    "605 А теперь пора нам в море;\n" +
                    "Тяжек воздух нам земли».\n" +
                    "Все потом домой ушли.\n" +
                    "\n" +
                    "Ветер по морю гуляет\n" +
                    "И кораблик подгоняет;\n" +
                    "610 Он бежит себе в волнах\n" +
                    "На поднятых парусах\n" +
                    "Мимо острова крутого,\n" +
                    "Мимо города большого;\n" +
                    "Пушки с пристани палят,\n" +
                    "615 Кораблю пристать велят.\n" +
                    "Пристают к заставе гости.\n" +
                    "Князь Гвидон зовёт их в гости,\n" +
                    "Их и кормит и поит\n" +
                    "И ответ держать велит:\n" +
                    "620 «Чем вы, гости, торг ведёте?\n" +
                    "И куда теперь плывёте?»\n" +
                    "Корабельщики в ответ:\n" +
                    "«Мы объехали весь свет;\n" +
                    "Торговали мы булатом,\n" +
                    "625 Чистым серебром и златом,\n" +
                    "И теперь нам вышел срок;\n" +
                    "А лежит нам путь далёк,\n" +
                    "Мимо острова Буяна,\n" +
                    "В царство славного Салтана».\n" +
                    "630 Говорит им князь тогда:\n" +
                    "«Добрый путь вам, господа,\n" +
                    "По морю по Окияну\n" +
                    "К славному царю Салтану.\n" +
                    "Да скажите ж: князь Гвидон\n" +
                    "635 Шлёт-де свой царю поклон».\n" +
                    "\n" +
                    "Гости князю поклонились,\n" +
                    "Вышли вон и в путь пустились.\n" +
                    "К морю князь, а лебедь там\n" +
                    "Уж гуляет по волнам.\n" +
                    "640 Князь опять: душа-де просит…\n" +
                    "Так и тянет и уносит…\n" +
                    "И опять она его\n" +
                    "Вмиг обрызгала всего.\n" +
                    "Тут он очень уменьшился,\n" +
                    "645 Шмелем князь оборотился,\n" +
                    "Полетел и зажужжал;\n" +
                    "Судно на море догнал,\n" +
                    "Потихоньку опустился\n" +
                    "На корму — и в щель забился.\n" +
                    "\n" +
                    "650 Ветер весело шумит,\n" +
                    "Судно весело бежит\n" +
                    "Мимо острова Буяна,\n" +
                    "В царство славного Салтана,\n" +
                    "И желанная страна\n" +
                    "655 Вот уж издали видна.\n" +
                    "Вот на берег вышли гости.\n" +
                    "Царь Салтан зовёт их в гости,\n" +
                    "И за ними во дворец\n" +
                    "Полетел наш удалец.\n" +
                    "660 Видит, весь сияя в злате,\n" +
                    "Царь Салтан сидит в палате\n" +
                    "На престоле и в венце,\n" +
                    "С грустной думой на лице.\n" +
                    "А ткачиха с поварихой,\n" +
                    "665 С сватьей бабой Бабарихой,\n" +
                    "Около царя сидят —\n" +
                    "Четырьмя все три глядят.\n" +
                    "Царь Салтан гостей сажает\n" +
                    "За свой стол и вопрошает:\n" +
                    "670 «Ой вы, гости-господа,\n" +
                    "Долго ль ездили? куда?\n" +
                    "Ладно ль за морем иль худо?\n" +
                    "И какое в свете чудо?»\n" +
                    "Корабельщики в ответ:\n" +
                    "670 «Мы объехали весь свет;\n" +
                    "За морем житьё не худо;\n" +
                    "В свете ж вот какое чудо:\n" +
                    "Остров на море лежит,\n" +
                    "Град на острове стоит,\n" +
                    "675 Каждый день идёт там диво:\n" +
                    "Море вздуется бурливо,\n" +
                    "Закипит, подымет вой,\n" +
                    "Хлынет на берег пустой,\n" +
                    "Расплеснется в скором беге —\n" +
                    "680 И останутся на бреге\n" +
                    "Тридцать три богатыря,\n" +
                    "В чешуе златой горя,\n" +
                    "Все красавцы молодые,\n" +
                    "Великаны удалые,\n" +
                    "685 Все равны, как на подбор;\n" +
                    "Старый дядька Черномор\n" +
                    "С ними из моря выходит\n" +
                    "И попарно их выводит,\n" +
                    "Чтобы остров тот хранить\n" +
                    "690 И дозором обходить —\n" +
                    "И той стражи нет надежней,\n" +
                    "Ни храбрее, ни прилежней.\n" +
                    "А сидит там князь Гвидон;\n" +
                    "Он прислал тебе поклон».\n" +
                    "695 Царь Салтан дивится чуду.\n" +
                    "«Коли жив я только буду,\n" +
                    "Чудный остров навещу\n" +
                    "И у князя погощу».\n" +
                    "Повариха и ткачиха\n" +
                    "700 Ни гугу — но Бабариха\n" +
                    "Усмехнувшись говорит:\n" +
                    "«Кто нас этим удивит?\n" +
                    "Люди из моря выходят\n" +
                    "И себе дозором бродят!\n" +
                    "705 Правду ль бают, или лгут,\n" +
                    "Дива я не вижу тут.\n" +
                    "В свете есть такие ль дива?\n" +
                    "Вот идет молва правдива:\n" +
                    "За морем царевна есть,\n" +
                    "710 Что не можно глаз отвесть:\n" +
                    "Днём свет божий затмевает,\n" +
                    "Ночью землю освещает,\n" +
                    "Месяц под косой блестит,\n" +
                    "А во лбу звезда горит.\n" +
                    "715 А сама-то величава,\n" +
                    "Выплывает, будто пава;\n" +
                    "А как речь-то говорит,\n" +
                    "Словно реченька журчит.\n" +
                    "Молвить можно справедливо,\n" +
                    "720 Это диво, так уж диво».\n" +
                    "Гости умные молчат:\n" +
                    "Спорить с бабой не хотят.\n" +
                    "Чуду царь Салтан дивится —\n" +
                    "А царевич хоть и злится,\n" +
                    "725 Но жалеет он очей\n" +
                    "Старой бабушки своей:\n" +
                    "Он над ней жужжит, кружится —\n" +
                    "Прямо на нос к ней садится,\n" +
                    "Нос ужалил богатырь:\n" +
                    "730 На носу вскочил волдырь.\n" +
                    "И опять пошла тревога:\n" +
                    "«Помогите, ради бога!\n" +
                    "Караул! лови, лови,\n" +
                    "Да дави его, дави…\n" +
                    "735 Вот ужо! пожди немножко,\n" +
                    "Погоди!..» А шмель в окошко,\n" +
                    "Да спокойно в свой удел\n" +
                    "Через море полетел.\n" +
                    "\n" +
                    "Князь у синя моря ходит,\n" +
                    "740 С синя моря глаз не сводит;\n" +
                    "Глядь — поверх текучих вод\n" +
                    "Лебедь белая плывет.\n" +
                    "«Здравствуй, князь ты мой прекрасный!\n" +
                    "Что ж ты тих, как день ненастный?\n" +
                    "745 Опечалился чему?» —\n" +
                    "Говорит она ему.\n" +
                    "Князь Гвидон ей отвечает:\n" +
                    "«Грусть-тоска меня съедает:\n" +
                    "Люди женятся; гляжу,\n" +
                    "750 Неженат лишь я хожу».\n" +
                    "— А кого же на примете\n" +
                    "Ты имеешь? — «Да на свете,\n" +
                    "Говорят, царевна есть,\n" +
                    "Что не можно глаз отвесть.\n" +
                    "755 Днём свет божий затмевает,\n" +
                    "Ночью землю освещает —\n" +
                    "Месяц под косой блестит,\n" +
                    "А во лбу звезда горит.\n" +
                    "А сама-то величава,\n" +
                    "760 Выступает, будто пава;\n" +
                    "Сладку речь-то говорит,\n" +
                    "Будто реченька журчит.\n" +
                    "Только, полно, правда ль это?»\n" +
                    "Князь со страхом ждёт ответа.\n" +
                    "765 Лебедь белая молчит\n" +
                    "И, подумав, говорит:\n" +
                    "«Да! такая есть девица.\n" +
                    "Но жена не рукавица:\n" +
                    "С белой ручки не стряхнёшь,\n" +
                    "770 Да за пояс не заткнёшь.\n" +
                    "Услужу тебе советом —\n" +
                    "Слушай: обо всем об этом\n" +
                    "Пораздумай ты путём,\n" +
                    "Не раскаяться б потом».\n" +
                    "775 Князь пред нею стал божиться,\n" +
                    "Что пора ему жениться,\n" +
                    "Что об этом обо всём\n" +
                    "Передумал он путём;\n" +
                    "Что готов душою страстной\n" +
                    "780 За царевною прекрасной\n" +
                    "Он пешком идти отсель\n" +
                    "Хоть за тридевять земель.\n" +
                    "Лебедь тут, вздохнув глубоко,\n" +
                    "Молвила: «Зачем далёко?\n" +
                    "785 Знай, близка судьба твоя,\n" +
                    "Ведь царевна эта — я».\n" +
                    "Тут она, взмахнув крылами,\n" +
                    "Полетела над волнами\n" +
                    "И на берег с высоты\n" +
                    "790 Опустилася в кусты,\n" +
                    "Встрепенулась, отряхнулась\n" +
                    "И царевной обернулась:\n" +
                    "Месяц под косой блестит,\n" +
                    "А во лбу звезда горит;\n" +
                    "795 А сама-то величава,\n" +
                    "Выступает, будто пава;\n" +
                    "А как речь-то говорит,\n" +
                    "Словно реченька журчит.\n" +
                    "Князь царевну обнимает,\n" +
                    "800 К белой груди прижимает\n" +
                    "И ведёт её скорей\n" +
                    "К милой матушки своей.\n" +
                    "Князь ей в ноги, умоляя:\n" +
                    "«Государыня-родная!\n" +
                    "805 Выбрал я жену себе,\n" +
                    "Дочь послушную тебе,\n" +
                    "Просим оба разрешенья,\n" +
                    "Твоего благословенья:\n" +
                    "Ты детей благослови\n" +
                    "810 Жить в совете и любви».\n" +
                    "Над главою их покорной\n" +
                    "Мать с иконой чудотворной\n" +
                    "Слезы льёт и говорит:\n" +
                    "«Бог вас, дети, наградит».\n" +
                    "815 Князь не долго собирался,\n" +
                    "На царевне обвенчался;\n" +
                    "Стали жить да поживать,\n" +
                    "Да приплода поджидать.\n" +
                    "\n" +
                    "Ветер по морю гуляет\n" +
                    "820 И кораблик подгоняет;\n" +
                    "Он бежит себе в волнах\n" +
                    "На раздутых парусах\n" +
                    "Мимо острова крутого,\n" +
                    "Мимо города большого;\n" +
                    "825 Пушки с пристани палят,\n" +
                    "Кораблю пристать велят.\n" +
                    "Пристают к заставе гости.\n" +
                    "Князь Гвидон зовёт их в гости,\n" +
                    "Он их кормит и поит\n" +
                    "830 И ответ держать велит:\n" +
                    "«Чем вы, гости, торг ведёте\n" +
                    "И куда теперь плывете?»\n" +
                    "Корабельщики в ответ:\n" +
                    "«Мы объехали весь свет,\n" +
                    "835 Торговали мы недаром\n" +
                    "Неуказанным товаром;\n" +
                    "А лежит нам путь далек:\n" +
                    "Восвояси на восток,\n" +
                    "Мимо острова Буяна,\n" +
                    "840 В царство славного Салтана».\n" +
                    "Князь им вымолвил тогда:\n" +
                    "«Добрый путь вам, господа,\n" +
                    "По морю по Окияну\n" +
                    "К славному дарю Салтану;\n" +
                    "845 Да напомните ему,\n" +
                    "Государю своему:\n" +
                    "К нам он в гости обещался,\n" +
                    "А доселе не собрался —\n" +
                    "Шлю ему я свой поклон».\n" +
                    "850 Гости в путь, а князь Гвидон\n" +
                    "Дома на сей раз остался\n" +
                    "И с женою не расстался.\n" +
                    "\n" +
                    "Ветер весело шумит,\n" +
                    "Судно весело бежит\n" +
                    "855 Мимо острова Буяна\n" +
                    "К царству славного Салтана,\n" +
                    "И знакомая страна\n" +
                    "Вот уж издали видна.\n" +
                    "860 Вот на берег вышли гости.\n" +
                    "Царь Салтан зовёт их в гости.\n" +
                    "Гости видят: во дворце\n" +
                    "Царь сидит в своем венце,\n" +
                    "А ткачиха с поварихой,\n" +
                    "865 С сватьей бабой Бабарихой,\n" +
                    "Около царя сидят,\n" +
                    "Четырьмя все три глядят.\n" +
                    "Царь Салтан гостей сажает\n" +
                    "За свой стол и вопрошает:\n" +
                    "870 «Ой вы, гости-господа,\n" +
                    "Долго ль ездили? куда?\n" +
                    "Ладно ль за морем, иль худо?\n" +
                    "И какое в свете чудо?»\n" +
                    "Корабельщики в ответ:\n" +
                    "875 «Мы объехали весь свет;\n" +
                    "За морем житьё не худо,\n" +
                    "В свете ж вот какое чудо:\n" +
                    "Остров на море лежит,\n" +
                    "Град на острове стоит,\n" +
                    "880 С златоглавыми церквами,\n" +
                    "С теремами и садами;\n" +
                    "Ель растет перед дворцом,\n" +
                    "А под ней хрустальный дом;\n" +
                    "Белка в нем живет ручная,\n" +
                    "885 Да чудесница какая!\n" +
                    "Белка песенки поёт\n" +
                    "Да орешки всё грызёт;\n" +
                    "А орешки не простые,\n" +
                    "Скорлупы-то золотые,\n" +
                    "890 Ядра — чистый изумруд;\n" +
                    "Белку холят, берегут.\n" +
                    "Там ещё другое диво:\n" +
                    "Море вздуется бурливо,\n" +
                    "Закипит, подымет вой,\n" +
                    "895 Хлынет на берег пустой,\n" +
                    "Расплеснется в скором беге,\n" +
                    "И очутятся на бреге,\n" +
                    "В чешуе, как жар горя,\n" +
                    "Тридцать три богатыря,\n" +
                    "900 Все красавцы удалые,\n" +
                    "Великаны молодые,\n" +
                    "Все равны, как на подбор —\n" +
                    "С ними дядька Черномор.\n" +
                    "И той стражи нет надежней,\n" +
                    "905 Ни храбрее, ни прилежней.\n" +
                    "А у князя жёнка есть,\n" +
                    "Что не можно глаз отвесть:\n" +
                    "Днём свет божий затмевает,\n" +
                    "Ночью землю освещает;\n" +
                    "910 Месяц под косой блестит,\n" +
                    "А во лбу звезда горит.\n" +
                    "Князь Гвидон тот город правит,\n" +
                    "Всяк его усердно славит;\n" +
                    "Он прислал тебе поклон,\n" +
                    "915 Да тебе пеняет он:\n" +
                    "К нам-де в гости обещался,\n" +
                    "А доселе не собрался».\n" +
                    "\n" +
                    "Тут уж царь не утерпел,\n" +
                    "Снарядить он флот велел.\n" +
                    "920 А ткачиха с поварихой,\n" +
                    "С сватьей бабой Бабарихой,\n" +
                    "Не хотят царя пустить\n" +
                    "Чудный остров навестить.\n" +
                    "Но Салтан им не внимает\n" +
                    "925 И как раз их унимает:\n" +
                    "«Что я? царь или дитя? —\n" +
                    "Говорит он не шутя: —\n" +
                    "Нынче ж еду!» — Тут он топнул,\n" +
                    "Вышел вон и дверью хлопнул.\n" +
                    "\n" +
                    "930 Под окном Гвидон сидит,\n" +
                    "Молча на море глядит:\n" +
                    "Не шумит оно, не хлещет,\n" +
                    "Лишь едва, едва трепещет,\n" +
                    "И в лазоревой дали\n" +
                    "935 Показались корабли:\n" +
                    "По равнинам Окияна\n" +
                    "Едет флот царя Салтана.\n" +
                    "Князь Гвидон тогда вскочил,\n" +
                    "Громогласно возопил:\n" +
                    "940 «Матушка моя родная!\n" +
                    "Ты, княгиня молодая!\n" +
                    "Посмотрите вы туда:\n" +
                    "Едет батюшка сюда».\n" +
                    "Флот уж к острову подходит.\n" +
                    "945 Князь Гвидон трубу наводит:\n" +
                    "Царь на палубе стоит\n" +
                    "И в трубу на них глядит;\n" +
                    "С ним ткачиха с поварихой,\n" +
                    "С сватьей бабой Бабарихой;\n" +
                    "950 Удивляются оне\n" +
                    "Незнакомой стороне.\n" +
                    "Разом пушки запалили;\n" +
                    "В колокольнях зазвонили;\n" +
                    "К морю сам идет Гвидон;\n" +
                    "955 Там царя встречает он\n" +
                    "С поварихой и ткачихой,\n" +
                    "С сватьей бабой Бабарихой;\n" +
                    "В город он повёл царя,\n" +
                    "Ничего не говоря.\n" +
                    "\n" +
                    "960 Все теперь идут в палаты:\n" +
                    "У ворот блистают латы,\n" +
                    "И стоят в глазах царя\n" +
                    "Тридцать три богатыря,\n" +
                    "Все красавцы молодые,\n" +
                    "965 Великаны удалые,\n" +
                    "Все равны, как на подбор,\n" +
                    "С ними дядька Черномор.\n" +
                    "Царь ступил на двор широкой:\n" +
                    "Там под ёлкою высокой\n" +
                    "970 Белка песенку поёт,\n" +
                    "Золотой орех грызёт,\n" +
                    "Изумрудец вынимает\n" +
                    "И в мешечек опускает;\n" +
                    "И засеян двор большой\n" +
                    "975 Золотою скорлупой.\n" +
                    "Гости дале — торопливо\n" +
                    "Смотрят — что ж? княгиня — диво:\n" +
                    "Под косой луна блестит,\n" +
                    "А во лбу звезда горит;\n" +
                    "980 А сама-то величава,\n" +
                    "Выступает, будто пава,\n" +
                    "И свекровь свою ведёт.\n" +
                    "Царь глядит — и узнаёт…\n" +
                    "В нём взыграло ретивое!\n" +
                    "985 «Что я вижу? что такое?\n" +
                    "Как!» — и дух в нём занялся…\n" +
                    "Царь слезами залился,\n" +
                    "Обнимает он царицу,\n" +
                    "И сынка, и молодицу,\n" +
                    "990 И садятся все за стол;\n" +
                    "И весёлый пир пошел.\n" +
                    "А ткачиха с поварихой,\n" +
                    "С сватьей бабой Бабарихой,\n" +
                    "Разбежались по углам;\n" +
                    "995 Их нашли насилу там.\n" +
                    "Тут во всём они признались,\n" +
                    "Повинились, разрыдались;\n" +
                    "Царь для радости такой\n" +
                    "Отпустил всех трёх домой.\n" +
                    "1000 День прошёл — царя Салтана\n" +
                    "Уложили спать вполпьяна.\n" +
                    "Я там был; мёд, пиво пил —\n" +
                    "И усы лишь обмочил.\n" +
                    "\n" +
                    "1831";
            mainInfo = "Three fair maidens, late one night,\n" +
                    "Sat and spun by candlelight.\n" +
                    "\"Were our tsar to marry me,\"\n" +
                    "Said the eldest of the three,\n" +
                    "\"I would cook and I would bake–\n" +
                    "Oh, what royal feasts I'd make.\"\n" +
                    "Said the second of the three:\n" +
                    "\"Were our tsar to marry me,\n" +
                    "I would weave a cloth of gold\n" +
                    "Fair and wondrous to behold.\"\n" +
                    "But the youngest of the three\n" +
                    "Murmured: \"If he married me–\n" +
                    "I would give our tsar an heir\n" +
                    "Handsome, brave, beyond compare.\"\n" +
                    "\n" +
                    "At these words their chamber door\n" +
                    "Gently creaked– and lo, before\n" +
                    "These three maidens' very eyes\n" +
                    "Stood their tsar, to their surprise.\n" +
                    "He had listened by their gate\n" +
                    "Whither he'd been led by fate,\n" +
                    "And the words that he heard last\n" +
                    "Made his heart with love beat fast.\n" +
                    "\"Greetings, maiden fair,\" said he–\n" +
                    "\"My tsaritsa you shall be,\n" +
                    "And, ere next September's done,\n" +
                    "See that you bear me a son.\n" +
                    "As for you, fair sisters two,\n" +
                    "Leave your home without ado;\n" +
                    "Leave your home and follow me\n" +
                    "And my bride that is to be.\n" +
                    "Royal weaver, YOU I'll make,\n" +
                    "YOU as royal cook I'll take.\"\n" +
                    "\n" +
                    "Then the tsar strode forth, and they\n" +
                    "Palacewards all made their way.\n" +
                    "There, he lost no time nor tarried\n" +
                    "That same evening he was married;\n" +
                    "Tsar Saltan and his young bride\n" +
                    "At the feast sat side by side.\n" +
                    "Then the guests, with solemn air,\n" +
                    "Led the newly wedded pair\n" +
                    "To their iv'ry couch, snow-white,\n" +
                    "Where they left them for the night.\n" +
                    "Bitterly, the weaver sighed,\n" +
                    "And the cook in passion cried,\n" +
                    "Full of jealousy and hate\n" +
                    "Of their sister's happy fate.\n" +
                    "But, by love and duty fired,\n" +
                    "She conceived, ere night expired,\n" +
                    "In her royal husband's arms.\n" +
                    "\n" +
                    "These were days of war's alarms.\n" +
                    "Ere he rode forth for the strife,\n" +
                    "Tsar Saltan embraced his wife,\n" +
                    "Bidding her to take good care\n" +
                    "Of herself and coming heir;\n" +
                    "While he battled on the field,\n" +
                    "Forcing countless foes to yield,\n" +
                    "God gave unto her an heir–\n" +
                    "Lusty, large of limb, and fair.\n" +
                    "Like a mother eagle, she\n" +
                    "Guarded him most jealously;\n" +
                    "Sent the news of God's glad gift\n" +
                    "To the tsar, by rider swift.\n" +
                    "But the royal cook, and weaver,\n" +
                    "And their mother, sly deceiver,\n" +
                    "Sought to ruin her, so they\n" +
                    "Had him kidnapped on the way,\n" +
                    "Sent another in his stead.\n" +
                    "Word for word, his message read:\n" +
                    "\"Your tsaritsa, sire, last night\n" +
                    "Was delivered of a fright–\n" +
                    "Neither son nor daughter, nor\n" +
                    "Have we seen its like before.\"\n" +
                    "\n" +
                    "At these words, the royal sire\n" +
                    "Raved and raged in furious ire,\n" +
                    "\"Hang that messenger!\" roared he,\n" +
                    "\"Hang him on the nearest tree!\"\n" +
                    "But, relenting, spared him, and\n" +
                    "Sent him back with this command:\n" +
                    "\"From all hasty steps refrain\n" +
                    "Till the tsar comes home again.\"\n" +
                    "\n" +
                    "Back the messenger rode fast,\n" +
                    "Reached the city gates at last.\n" +
                    "But the royal cook, and weaver,\n" +
                    "With their mother, sly deceiver,\n" +
                    "Made him drunk; and in his sleep\n" +
                    "Stole the message from his keep\n" +
                    "And, before he could recover,\n" +
                    "They replaced it by another.\n" +
                    "So, with feet unsteady, he\n" +
                    "Reached the court with this decree:\n" +
                    "\"Have the queen and have her spawn\n" +
                    "Drowned in secret ere the dawn.\"\n" +
                    "Grieving for their monarch's heir,\n" +
                    "For the mother young and fair,\n" +
                    "Solemnly the tsar's boyards\n" +
                    "Told the queen of this ukaz,\n" +
                    "Of the cruel doom which fate\n" +
                    "So unkindly had in wait.\n" +
                    "This unpleasant duty done,\n" +
                    "Put the queen and put her son\n" +
                    "In a cask, and sealed it fast;\n" +
                    "Tarred it well, and then they cast\n" +
                    "Cask and burden in the sea–\n" +
                    "Such, forsooth, the tsar's decree.\n" +
                    "\n" +
                    "Stars gleam in the dark blue sky,\n" +
                    "Dark blue billows heave and sigh.\n" +
                    "Storm clouds o'er the blue sky creep,\n" +
                    "While the cask rides o'erthe deep.\n" +
                    "Like a widowed bride distressed,\n" +
                    "Sobbed the queen and beat her breast,\n" +
                    "While the babe to manhood grew\n" +
                    "As the hours swiftly flew.\n" +
                    "Morning dawned, the queen still waited\n" +
                    "But her son the billows hailed:\n" +
                    "\"O, you wanton waves so blue –\n" +
                    "Free to come and go are you,\n" +
                    "Dashing when and where you please,\n" +
                    "Wearing rocks away with ease –\n" +
                    "You, who flood the mountains high,\n" +
                    "You, who ships raise to the sky–\n" +
                    "Hear my prayer, o waves, and spare us–\n" +
                    "Safely onto dry land bear us.\"\n" +
                    "So the waves, without ado,\n" +
                    "Bore the cask and prisoners two\n" +
                    "Gently to a sandy shore,\n" +
                    "Then, receding, splashed no more.\n" +
                    "Son and mother, safe and sound,\n" +
                    "Feel that they're on solid ground.\n" +
                    "From their cask, though, who will take them?\n" +
                    "Surely God will not forsake them?\n" +
                    "Murmuring: \"I wonder how\n" +
                    "We could break our prison now?\"\n" +
                    "Up the son stood on his toes,\n" +
                    "Stretched himself, and said: \"Here goes!\"–\n" +
                    "Thrust his head against the lid,\n" +
                    "Burst it out–and forth he slid.\n" +
                    "\n" +
                    "Son and mother, free again,\n" +
                    "Saw a hillock on a plain;\n" +
                    "On its crest, an oak tree grew;\n" +
                    "Round them flowed the ocean blue.\n" +
                    "Quoth the son: \"Some food and drink\n" +
                    "Wouldn't come amiss, I think.\"\n" +
                    "From the oak, a branch he rent\n" +
                    "And a sturdy bow he bent.\n" +
                    "With the silken cord that hung\n" +
                    "Round his neck, the bow he strung.\n" +
                    "From a slender reed and light,\n" +
                    "Shaped an arrow, true in flight.\n" +
                    "Then explored the isle for game,\n" +
                    "Till he to the sea-shore came.\n" +
                    "\n" +
                    "Just as he approached the beach,\n" +
                    "Our young hunter heard a screech..;\n" +
                    "Of distress at sea it told.\n" +
                    "He looked round him, and, behold,\n" +
                    "Saw a swan in evil plight;\n" +
                    "Circling over it–a kite,\n" +
                    "Talons spread, and bloodstained beak\n" +
                    "Poised, prepared her death to wreak,\n" +
                    "While the helpless bird was splashing,\n" +
                    "With her wings the waters lashing.\n" +
                    "But his shaft, with baneful note,\n" +
                    "Struck the kite full in the throat.\n" +
                    "Bleeding, in the sea it fell,\n" +
                    "Screeching like a soul in hell.\n" +
                    "He, with lowered bow, looked on\n" +
                    "As, with beak and wings, the swan,\n" +
                    "Dealing ruthless blow on blow\n" +
                    "On the cruel kite, her foe,\n" +
                    "Sped its death, till finally\n" +
                    "Lifeless it sank in the sea.\n" +
                    "Then, in Russian accents, she\n" +
                    "Murmured plain as plain could be:\n" +
                    "\"O, tsarevich, champion peerless,\n" +
                    "My deliverer so fearless–\n" +
                    "Grieve not that because of me\n" +
                    "Your good shaft is in the sea:\n" +
                    "That you'll have to fast three morrows–\n" +
                    "This is but the least of sorrows.\n" +
                    "Your kind deed I will repay–\n" +
                    "I will serve you too, one day;\n" +
                    "'Tis no swan that you set free,\n" +
                    "But a maiden charmed, you see;\n" +
                    "'Twas a wizard, not a kite,\n" +
                    "That you slew, O noble knight;\n" +
                    "I shall ne'er forget your deed–\n" +
                    "I'll be with you in your need.\n" +
                    "Now go back and take your rest–\n" +
                    "All will turn out for the best.\"\n" +
                    "\n" +
                    "Then the swan-bird flew from view\n" +
                    "While, perforce, the luckless two,\n" +
                    "Famished, laid them down to sleep,\n" +
                    "Praying God their souls to keep.\n" +
                    "Driving slumber from his eyes\n" +
                    "As the sun rose in the skies,\n" +
                    "Our tsarevich, much amazed,\n" +
                    "At a spacious city gazed,\n" +
                    "Girdled by a wide and tall,\n" +
                    "Strong-embattled snow-white wall.\n" +
                    "Churches golden-domed stood there,\n" +
                    "Holy cloisters, mansions fair.\n" +
                    "\"Mother mine, awaken!\" cried he–\n" +
                    "\"Oh!\" she gasped; he said: \"I see\n" +
                    "Things have only just begun–\n" +
                    "My white swan is having tun,\"\n" +
                    "Citywards their steps they bent,\n" +
                    "Through the city gates they went.\n" +
                    "Belfries thundered overhead\n" +
                    "Loud enough to wake the dead.\n" +
                    "Round them poured a mighty throng,\n" +
                    "Choir boys praised the Lord in song;\n" +
                    "Nobles, splendidly arrayed,\n" +
                    "Came in coaches, gold inlaid.\n" +
                    "All the people cheered them madly,\n" +
                    "As their prince acclaimed him gladly,\n" +
                    "With his mother's blessing, he,\n" +
                    "Acquiescing graciously,\n" +
                    "That same day began to reign\n" +
                    "In his newly-found domain,\n" +
                    "Sat in state upon the throne\n" +
                    "And was crowned as Prince Guidon.\n" +
                    "\n" +
                    "Breezes o'er the ocean play,\n" +
                    "Speed a barque upon its way;\n" +
                    "Sails all spread, it skims the seas,\n" +
                    "Running swiftly 'fore the breeze.\n" +
                    "Sailors, merchants, crowd the deck,\n" +
                    "Marvel loud and crane their necks.\n" +
                    "Wondrous changes meet their view\n" +
                    "On an island which they knew!\n" +
                    "There, a golden city grand,\n" +
                    "Newly built, and fortress stand,\n" +
                    "Cannons with a mighty roar\n" +
                    "Bid the merchants put to shore.\n" +
                    "When the merchants land, Guidon\n" +
                    "Bids them be his guests anon;\n" +
                    "Feasts them first with meats and wit\n" +
                    "Then he says: \"Now, masters mine–\n" +
                    "Tell me what you have for sale,\n" +
                    "Whither bound, and whence you hail?\"\n" +
                    "Said the merchants: \"If you please.\n" +
                    "We have sailed the seven seas;\n" +
                    "Costly furs, prince, were our ware.\n" +
                    "Silver fox and sables rare.\n" +
                    "Now our time is overstayed,\n" +
                    "East–due East–our course is laid,\n" +
                    "Past the Island of Buyan,\n" +
                    "Back to gracious Tsar Saltan.\"\n" +
                    "\"Gentles,\" murmured Prince Guidon,\n" +
                    "\"May fair breezes speed you on,\n" +
                    "And, when Tsar Saltan you see\n" +
                    "Bow down low to him for me.\"\n" +
                    "Here the merchants made their bows,\n" +
                    "And the prince, with pensive brows,\n" +
                    "Watched their ship put out from shore\n" +
                    "Till it could be seen no more.\n" +
                    "Suddenly, before Guidon\n" +
                    "Swam the graceful snow-white swan.\n" +
                    "\"Greetings, my fair prince,\" said she–\n" +
                    "\"Why are you so sad, tell me?\n" +
                    "Why are you so dismal, say,\n" +
                    "Like a gloomy, cloudy day?\"\n" +
                    "\"Grief is gnawing at my breast,\"\n" +
                    "Answered Prince Guidon, distressed.\n" +
                    "\"I have only one desire–\n" +
                    "I should like to see my sire.\"\n" +
                    "\"Is that all?\" was her reply–\n" +
                    "\"Listen–would you like to fly,\n" +
                    "Overtake that ship at sea?\n" +
                    "Why, then–a mosquito be!\"\n" +
                    "Then she flapped her pinions two,\n" +
                    "Loudly thrashed the waters blue,\n" +
                    "Drenching him from head to toe\n" +
                    "Ere he could say yes or no.\n" +
                    "And he hovered, then and there,\n" +
                    "A mosquito, in the air.\n" +
                    "Buzzed, and flying rapidly,\n" +
                    "Overtook the ship at sea,\n" +
                    "Settled noiselessly, and stole\n" +
                    "Out of sight, into a hole.\n" +
                    "\n" +
                    "I. Bilbin\n" +
                    "\n" +
                    "Merrily the breeze is singing,\n" +
                    "O'er the waves a ship is winging\n" +
                    "Past the Island of Buyan\n" +
                    "To the realm of Tsar Saltan.\n" +
                    "Now his longed-for land so dear\n" +
                    "Stands out in the distance, clear,\n" +
                    "Now the ship at anchor rests\n" +
                    "And the merchants, honored guests,\n" +
                    "Palacewards their footsteps make\n" +
                    "With our gallant in their wake.\n" +
                    "There, in regal raiment, sate\n" +
                    "Tsar Saltan in royal state.\n" +
                    "On his head–his jeweled crown;\n" +
                    "On his face–a pensive frown,\n" +
                    "While the royal cook, and weaver,\n" +
                    "And their mother, sly deceiver,\n" +
                    "Sitting on his left and right,\n" +
                    "Stared at him with all their might.\n" +
                    "Tsar Saltan, with royal grace,\n" +
                    "Gave the merchants each his place,\n" +
                    "Then he said: \"Now, masters mine,\n" +
                    "Sailed you far across the brine?\n" +
                    "Are things well where you have been?\n" +
                    "What strange wonders have you seen?\"\n" +
                    "Quoth the merchants: \"If you please,\n" +
                    "We have sailed the seven seas;\n" +
                    "Peace reigns overseas, serene.\n" +
                    "There, we saw this wondrous scene:\n" +
                    "There's an island in the sea,\n" +
                    "Shores as steep as steep can be;\n" +
                    "Cheerless once, deserted, bare–\n" +
                    "Nothing but an oak grew there.\n" +
                    "Now it has a new-built city,\n" +
                    "Stately mansions, gardens pretty,\n" +
                    "Churches tall with domes of go\n" +
                    "Fair and wondrous to behold.\n" +
                    "Prince Guidon reigns there, and\n" +
                    "Sends his compliments to thee.'\n" +
                    "Here the tsar said, in amaze:\n" +
                    "\"If but God prolong my days,\n" +
                    "I shall visit this strange isle,\n" +
                    "Guest with this Guidon a while.\"\n" +
                    "But the royal cook, and weaver,\n" +
                    "With their mother, sly deceiver,\n" +
                    "Did not wish to let their tsar\n" +
                    "See this wondrous isle so far.\n" +
                    "\"What a wonder,\" quoth the cook,\n" +
                    "Winking at the others\"Look:\n" +
                    "There's a city by the shore!\n" +
                    "Have you heard the like before?\n" +
                    "Here's a wonder, though, worth telling–\n" +
                    "There's a little squirrel dwelling\n" +
                    "In a fir tree; all day long,\n" +
                    "Cracking nuts, it sings a song.\n" +
                    "Nuts–most wondrous to behold!\n" +
                    "Every shell is solid gold;\n" +
                    "Kernels–each an emerald pure!\n" +
                    "That's a wonder, to be sure.\"\n" +
                    "Tsar Saltan thought this most curious,\n" +
                    "Our mosquito waxed most furious\n" +
                    "And, with his mosquito might,\n" +
                    "Stung his aunt's right eye, in spite.\n" +
                    "Turning pale, she swooned from pain–\n" +
                    "But her eye ne'er saw again.\n" +
                    "Sister, serving maids and mother,\n" +
                    "Chased him, tripping one another,\n" +
                    "Screamed: \"You cursed insect, you!\n" +
                    "Only wait!\" But he just flew\n" +
                    "Through a casement, o'erthe main,\n" +
                    "Swiftly to his own domain.\n" +
                    "\n" +
                    "Pensively Guidon once more\n" +
                    "Gazes seaward from the shore.\n" +
                    "Suddenly, before his sight\n" +
                    "Swam the graceful swan, snow-white.\n" +
                    "\"Greetings, my fair prince,\" said she–\n" +
                    "\"Why are you so sad, tell me?\n" +
                    "Why are you so dismal, say\n" +
                    "Like a gloomy, cloudy day?\"\n" +
                    "\"Grief is gnawing at my breast,\"\n" +
                    "Answered Prince Guidon, distressed–\n" +
                    "\"There's a wonder, I confess,\n" +
                    "That I'm burning to possess.\n" +
                    "'Tis a wonder well worth telling–\n" +
                    "Somewhere, there's a squirrel dwelling\n" +
                    "In a fir tree; all day long,\n" +
                    "Cracking nuts, it sings a song.\n" +
                    "Nuts, most wondrous, I am told;\n" +
                    "Every shell is solid gold,\n" +
                    "Kernels–each an emerald pure.\n" +
                    "But can I of this be sure?\"\n" +
                    "Here the swan said in reply:\n" +
                    "\"Yes–this rumor does not lie;\n" +
                    "Marvel not–though this may be\n" +
                    "Strange for you, 'tis not for me.\n" +
                    "Grieve not–I will gladly do\n" +
                    "This slight service, prince, for you.\"\n" +
                    "Home he sped with cheerful stride,\n" +
                    "Gained his palace courtyard wide.\n" +
                    "There, beneath a fir–behold!–\n" +
                    "Cracking nuts all made of gold,\n" +
                    "Emeralds left and right a-flinging,\n" +
                    "Sat that wonder-squirrel, singing:\n" +
                    "\"Through the garden there she goes,\n" +
                    "Tripping on her dainty toes.\"\n" +
                    "With its tail the squirrel sweeps\n" +
                    "Shells and stones in tidy heaps,\n" +
                    "While a charmed and happy throng\n" +
                    "Listened to the squirrel's song.\n" +
                    "Struck with wonder, Prince Guidon\n" +
                    "Whispered softly: \"Thank you, swan!\n" +
                    "God grant you felicity\n" +
                    "And such joy as you gave me.\"\n" +
                    "Then a squirrel's house he built.\n" +
                    "Crystal, glass, and silver gilt;\n" +
                    "Set a guard, a scribe as well,\n" +
                    "Who recorded every shell.\n" +
                    "Thus the prince's treasures grew,\n" +
                    "And the squirrel's glory too.\n" +
                    "\n" +
                    "Breezes o'er the ocean play\n" +
                    "Speed a barque upon its way;\n" +
                    "Sails all spread, it skims the seas,\n" +
                    "Running swiftly \"fore the breeze\n" +
                    "Past a craggy island, where\n" +
                    "Stands a city, proud and fair.\n" +
                    "Cannons with a mighty roar\n" +
                    "Bid the merchants put to shore;\n" +
                    "When the merchants land, Guidon\n" +
                    "Bids them be his guests anon;\n" +
                    "Feasts them first with meats and wine,\n" +
                    "Then he says: \"Now, masters mine–\n" +
                    "Tell me what you have for sale,\n" +
                    "Whither bound, and whence you hail?\"\n" +
                    "Said the merchants: \"If you please,\n" +
                    "We have sailed the seven seas,\n" +
                    "Selling horses, Prince Guidon–\n" +
                    "Stallions from the steppes of Don.\n" +
                    "We are overdue, you know,\n" +
                    "And we still have far to go–\n" +
                    "Past the Island of Buyan,\n" +
                    "Back to gracious Tsar Saltan.\"\n" +
                    "\"Gentles,\" murmured Prince Guidon–\n" +
                    "\"May fair breezes speed you on\n" +
                    "O'er the ocean, o'er the main,\n" +
                    "Back to Tsar Saltan again,\n" +
                    "When your gracious tsar you see,\n" +
                    "Give him compliments from me.\"\n" +
                    "\n" +
                    "Bowing low before him, they\n" +
                    "Left Guidon and sailed away.\n" +
                    "He, though, hastened to the shore,\n" +
                    "Where he met the swan once more,\n" +
                    "Told her that his heart was burning,\n" +
                    "For his sire, his soul was yearning...\n" +
                    "In the twinkling of an eye\n" +
                    "He became a tiny fly,\n" +
                    "And he flew across the sea\n" +
                    "Where, 'twixt sky and ocean, he\n" +
                    "Settled on the deck and stole\n" +
                    "Out of sight into a hole.\n" +
                    "\n" +
                    "Merrily the breeze is singing,\n" +
                    "O'er the waves a ship is winging,\n" +
                    "Past the Island of Buyan,\n" +
                    "To the realm of Tsar Saltan,\n" +
                    "Now his longed-for land so dear,\n" +
                    "Stands out in the distance, clear,\n" +
                    "Now the ship at anchor rests,\n" +
                    "And the merchants, honored guests,\n" +
                    "Palacewards their footsteps make\n" +
                    "With our gallant in their wake.\n" +
                    "There, in regal raiment, sate\n" +
                    "Tsar Saltan in royal state.\n" +
                    "On his head–his jeweled crown,\n" +
                    "On his face–a' pensive frown,\n" +
                    "While the one-eyed cook, and weaver,\n" +
                    "And their mother, sly deceiver,\n" +
                    "Sit around the tsar and stare\n" +
                    "At him with a toad-like glare.\n" +
                    "Tsar Saltan, with royal grace,\n" +
                    "Gave the merchants each his place,\n" +
                    "Then he said: \"Now, masters mine–\n" +
                    "Sailed you far across the brine?\n" +
                    "Are things well where you have been?\n" +
                    "What strange wonders have you seen?\"\n" +
                    "Quoth the merchants: \"If you please,\n" +
                    "We have sailed the seven seas;\n" +
                    "Peace reigns overseas, serene.\n" +
                    "There, we saw this wondrous scene:\n" +
                    "On an island, far away,\n" +
                    "Stands a city, grand and gay–\n" +
                    "Churches tall, with golden domes,\n" +
                    "Gardens green and stately homes;\n" +
                    "By the palace grows a fir\n" +
                    "In whose shade, O royal sir,\n" +
                    "Stands a crystal cage; and there\n" +
                    "Dwells a squirrel, strange and rare–\n" +
                    "Full of frolic; all day long,\n" +
                    "Cracking nuts, it sings a song,\n" +
                    "Nuts, most wondrous to behold–\n" +
                    "Every shell is solid gold,\n" +
                    "Kernels–each an emerald bright;\n" +
                    "Sentries guard it day and night,\n" +
                    "It has slaves, like any lord,\n" +
                    "Yes, and scribes each nut record.\n" +
                    "Troops in passing give salute\n" +
                    "With their martial drum and flute.\n" +
                    "Maidens store these gems away\n" +
                    "Under lock and key each day;\n" +
                    "Coins are minted from each shell,\n" +
                    "Coins with which they buy and sell.\n" +
                    "People live in plenty there,\n" +
                    "Not in huts, but mansions fair.\n" +
                    "Prince Guidon reigns there, and he\n" +
                    "Sends his compliments to thee.\"\n" +
                    "Here the tsar said, in amaze:\n" +
                    "\"If but God prolong my days,\n" +
                    "I shall visit this strange isle\n" +
                    "Guest with this Guidon a while.\"\n" +
                    "But the cook, and royal weaver,\n" +
                    "With their mother, sly deceiver,\n" +
                    "Did not wish to let the tsar\n" +
                    "See this wondrous isle so far.\n" +
                    "And the weaver, smiling wryly,\n" +
                    "Thus addressed the tsar, most slyly:\n" +
                    "\"Wherein lies this wonder, pray?\n" +
                    "Squirrels cracking nuts all day–\n" +
                    "Heaping emeralds, we're told,\n" +
                    "Left and right a-throwing gold!\n" +
                    "Nothing strange in this see I!\n" +
                    "Be this true, or but a lie,\n" +
                    "I know of a better wonder.\n" +
                    "Lo! The ocean swells in thunder,\n" +
                    "Surges with a mighty roar,\n" +
                    "Overflows a barren shore,\n" +
                    "Leaving, wonderful to see,\n" +
                    "Thirty stalwart knights and three,\n" +
                    "All in mail a-gleaming bright,\n" +
                    "Marching proudly left and right;\n" +
                    "Each one brave beyond compare,\n" +
                    "Tall of stature, young and fair,\n" +
                    "All alike beyond belief,\n" +
                    "Led by Chernomor, their chief.\n" +
                    "That's a wonder, now, for you,\n" +
                    "Marvelously strange, but true.\"\n" +
                    "Wisely, though, the guests were mute–\n" +
                    "They with her did not dispute.\n" +
                    "But the tsar waxed very curious,\n" +
                    "And Guidon waxed very furious,\n" +
                    "Fiercely buzzed and settled right\n" +
                    "On his aunt's left eye, in spite.\n" +
                    "Turning pale, she gave a cry–\n" +
                    "She was blinded in her eye.\n" +
                    "Screams of anger filled the air–\n" +
                    "\"Catch it! kill that insect there!\n" +
                    "O you nasty insect, you!\"\n" +
                    "But Guidon just calmly flew\n" +
                    "Through the casement, o'erthe main,\n" +
                    "Swiftly to his own domain.\n" +
                    "\n" +
                    "By the blue sea he is pacing,\n" +
                    "On the blue sea he is gazing.\n" +
                    "And once more, before his sight\n" +
                    "Swam the graceful swan, snow-white.\n" +
                    "\"Greetings, my fair prince,\" said she,\n" +
                    "\"Why are you so sad, tell me?\n" +
                    "Why are you so dismal, say,\n" +
                    "Like a gloomy, cloudy day?\"\n" +
                    "\"Grief is gnawing at my breast,\"\n" +
                    "Answered Prince Guidon, distressed–\n" +
                    "\"There's a wonder, I confess,\n" +
                    "That I'm longing to possess,\"\n" +
                    "\"Tell me then, what is this wonder?\"\n" +
                    "\"Somewhere swells the sea in thunder,\n" +
                    "Breakers surge, and with a roar,\n" +
                    "Sweeping o'er a barren shore,\n" +
                    "Leave behind, for all to see\n" +
                    "Thirty stalwart knights and three,\n" +
                    "All in mail a-gleaming bright,\n" +
                    "Marching proudly left and right;\n" +
                    "Each one brave beyond compare,\n" +
                    "Tall of stature, young and fair.\n" +
                    "All alike beyond belief,\n" +
                    "Led by Chernomor, their chief.\"\n" +
                    "In reply, the snow-white swan\n" +
                    "Murmured: \"Is this all, Guidon?\n" +
                    "Wonder not– though this may be\n" +
                    "Strange for you, 'tis not for me,\n" +
                    "or these sea-knights, prince, are none\n" +
                    "But my brothers, every one.\n" +
                    "Do not grieve; go home and wait,\n" +
                    "Meet my brothers at your gate.\"\n" +
                    "\n" +
                    "He obeyed her cheerfully,\n" +
                    "Climbed his tower and scanned the seas\n" +
                    "Lo! the waters, with a roar.\n" +
                    "Seethed and swept the barren shore,\n" +
                    "Leaving, wonderful to see,\n" +
                    "Thirty stalwart knights and three,\n" +
                    "All in mail a-gleaming bright,\n" +
                    "Marching proudly left and right,\n" +
                    "Two by two; and Chernomor,\n" +
                    "Hoary-headed, went before,\n" +
                    "Leading them in martial state\n" +
                    "Right up to the city gate,\n" +
                    "Prince Guidon, with flying feet,\n" +
                    "Ran in haste his guests to greet;\n" +
                    "Crowds pressed round in unbelief.\n" +
                    "\"Prince,\" proclaimed the hoary chief–\n" +
                    "\"It is by the swan's request\n" +
                    "And, at her express behest,\n" +
                    "We have come from out the sea\n" +
                    "Your fair city's guards to be.\n" +
                    "Henceforth, from the ocean blue,\n" +
                    "We will always come to you\n" +
                    "Every day, on guard to stand\n" +
                    "By your lofty walls so grand.\n" +
                    "Now, however, we must go–\n" +
                    "We're not used to land, you know:\n" +
                    "We'll return, I promise you.\"\n" +
                    "And they disappeared from view.\n" +
                    "Breezes o'erthe ocean play\n" +
                    "Speed a barque upon its way;\n" +
                    "Sails all spread, it skims the seas,\n" +
                    "Running swiftly 'fore the breeze,\n" +
                    "Past a craggy island, where\n" +
                    "Stands a city, proud and fair.\n" +
                    "Cannons with a mighty roar\n" +
                    "Bid the merchants put to shore;\n" +
                    "When the merchants land, Guidon\n" +
                    "Bids them be his guests anon;\n" +
                    "Feasts them first with meat and wine,\n" +
                    "Then he says: \"Now, masters mine–\n" +
                    "Tell me what you have for sale,\n" +
                    "Whither bound, and whence you hail?\"\n" +
                    "Said the merchants: \"If you please,\n" +
                    "We have sailed the seven seas;\n" +
                    "Swords of Damask steel we've sold,\n" +
                    "Virgin silver, too, and gold.\n" +
                    "Now we're overdue, you know,\n" +
                    "And we still have far to go–\n" +
                    "Past the Island of Buyan,\n" +
                    "Back to gracious Tsar Saltan,\"\n" +
                    "\"Gentles,\" murmured Prince Guidon–\n" +
                    "\"May fair breezes speed you on,\n" +
                    "O'er the ocean, o'er the main,\n" +
                    "Back to Tsar Saltan again.\n" +
                    "Yes, and when your tsar you see,\n" +
                    "Give him compliments from me.\"\n" +
                    "\n" +
                    "Bowing low before him, they\n" +
                    "Left the prince and sailed away.\n" +
                    "He, though, hastened to the shore\n" +
                    "Where he met the swan once more;\n" +
                    "Told her that his heart was burning,\n" +
                    "For his sire, his soul was yearning...\n" +
                    "So she drenched him, head to toe.\n" +
                    "In a trice, he shrank, and lo!\n" +
                    "Ere or he could even gasp,\n" +
                    "He had turned into a wasp.\n" +
                    "Then he buzzed, and rapidly\n" +
                    "Overtook the ship at sea;\n" +
                    "Gently settled aft, and stole\n" +
                    "Out of sight into a hole.\n" +
                    "\n" +
                    "Merrily the breeze is singing,\n" +
                    "O'erthe waves a ship is winging\n" +
                    "Past the Island of Buyan\n" +
                    "To the realm of Tsar Saltan.\n" +
                    "Now his longed-for land so dear\n" +
                    "Stands out in the distance, clear.\n" +
                    "Now the ship at anchor rests,\n" +
                    "And the merchants, honored guests\n" +
                    "Palacewards their footsteps make\n" +
                    "With our gallant in their wake.\n" +
                    "There, in regal raiment, sate\n" +
                    "Tsar Saltan in royal state.\n" +
                    "On his head–his jeweled crown,\n" +
                    "On his face–a pensive frown,\n" +
                    "Near him–royal cook, and weaver\n" +
                    "And their mother, sly deceiver.\n" +
                    "With four eyes, though they be three,\n" +
                    "Stare at him voraciously.\n" +
                    "Tsar Saltan, with royal grace,\n" +
                    "Gave the merchants each his place.\n" +
                    "Then he said: \"Now, masters mine–\n" +
                    "Sailed you far across the brine?\n" +
                    "Are things well where you have been?\n" +
                    "What strange wonders have you seen?\"\n" +
                    "Quoth the merchants: \"If you please,\n" +
                    "We have sailed the seven seas;\n" +
                    "Peace reigns overseas, serene,\n" +
                    "There we saw this wondrous scene:\n" +
                    "There's an island far away–\n" +
                    "On this isle–a city gay;\n" +
                    "There, each dawn brings in new wonders:\n" +
                    "There, the ocean swells and thunders,\n" +
                    "Breakers, with a mighty roar,\n" +
                    "Foaming, flood its barren shore,\n" +
                    "Leaving, wonderful to see,\n" +
                    "Thirty stalwart knights and three\n" +
                    "All in mail a-gleaming bright\n" +
                    "Marching proudly left and right,\n" +
                    "Each one brave beyond compare\n" +
                    "Tall of stature, young and fair,\n" +
                    "All alike beyond belief;\n" +
                    "Hoary Chernomor, their chief,\n" +
                    "Marches with them from the deep,\n" +
                    "Counts them off, by twos, to keep\n" +
                    "Guard of this fair isle; and they\n" +
                    "Cease patrol nor night nor day.\n" +
                    "Nor can you find guards so true,\n" +
                    "Vigilant and fearless, too.\n" +
                    "Prince Guidon reigns there, and he\n" +
                    "Sends his compliments to thee.\"\n" +
                    "Here the tsar said, in amaze:\n" +
                    "\"If but God prolong my days,\n" +
                    "I shall visit this strange isle,\n" +
                    "Guest with this Guidon a while.\"\n" +
                    "Silent were the cook and weaver.\n" +
                    "But their mother, sly deceiver,\n" +
                    "Said, as she smiled crookedly:\n" +
                    "\"You may think this strange–not we!\n" +
                    "Fancy! Idle mermen play\n" +
                    "Sentry–go on land all day!\n" +
                    "Be this true, or but a lie,\n" +
                    "Nothing strange in this see I–\n" +
                    "Stranger things exist, mark you–\n" +
                    "This report, though, is quite true:\n" +
                    "There's a young princess, they say,\n" +
                    "That she charms all hearts away.\n" +
                    "Brighter than the sun at noon,\n" +
                    "She outshines the midnight moon,\n" +
                    "In her braids a crescent beams,\n" +
                    "On her brow, a bright star gleams.\n" +
                    "She herself is sweet of face.\n" +
                    "Full of majesty and grace.\n" +
                    "When she speaks, her voice doth seem\n" +
                    "Like the music of a stream.\n" +
                    "That's a wonder, now, for you–\n" +
                    "Marvelously strange, but true.\"\n" +
                    "Wisely, though, the guests prefer\n" +
                    "Not to bandy words with her.\n" +
                    "Tsar Saltan, he waxed most curious,\n" +
                    "Our tsarevich waxed most furious,\n" +
                    "But decided that he'd spare\n" +
                    "Granny's eyes for her gray hair.\n" +
                    "Buzzing like a bumble-bee,\n" +
                    "Round his granny circled he,\n" +
                    "Stung her nose with all his might,\n" +
                    "Raising blisters red and white.\n" +
                    "Panic once more filled the air:\n" +
                    "\"Murder! catch that insect there!\n" +
                    "Help! O don't you let it go!\n" +
                    "Catch it!–hold it!–kill it!–O!\n" +
                    "O, you nasty insect, you!\n" +
                    "Just you wait!\" Guidon, though, flew\n" +
                    "Through the casement, o'erthe main\n" +
                    "Back to his domain again.\n" +
                    "\n" +
                    "By the sea, the prince now paces,\n" +
                    "On the blue sea now he gazes,\n" +
                    "Suddenly, before Guidon\n" +
                    "Swam the graceful snow-white swan.\n" +
                    "\"Greetings, my fair prince,\" said she\n" +
                    "\"Why are you so sad, tell me?\n" +
                    "Why are you so dismal, say,\n" +
                    "Like a gloomy, cloudy day?\"\n" +
                    "\"Grief is gnawing at my breast,\"\n" +
                    "Answered Prince Guidon, distressed\n" +
                    "\"Every youth has his own bride–\n" +
                    "Only I unmarried bide.\"\n" +
                    "\"Who is she you wish to wed?\n" +
                    "Tell me, now.\" Guidon then said:\n" +
                    "\"There's a fair princess; they say\n" +
                    "That she charms both young and old–\n" +
                    "Brighter than the sun at noon,\n" +
                    "She outshines the midnight moon;\n" +
                    "In her braids, a crescent beams,\n" +
                    "On her brow, a bright star gleams.\n" +
                    "She herself is sweet of face,\n" +
                    "Full of majesty and grace.\n" +
                    "When she speaks, her sweet voice seems\n" +
                    "Like the flow of tinkling streams.\n" +
                    "Is this true, though, or a lie?\"\n" +
                    "Anxiously, he waits reply.\n" +
                    "Silently, the snow-white swan\n" +
                    "Pondered; then she said: \"Guidon–\n" +
                    "Yes–this maiden I can find;\n" +
                    "But a wife's no mitten, mind,\n" +
                    "From your lily hand to cast,\n" +
                    "Or unto your belt make fast;\n" +
                    "Listen now to my advice:\n" +
                    "Weigh this matter well–think twice,\n" +
                    "So that on your marriage morrow\n" +
                    "You do not repent in sorrow.\"\n" +
                    "Here Guidon with ardor swore\n" +
                    "That he'd thought of this before;\n" +
                    "That 'twas high time he was married,\n" +
                    "Too long single had he tarried;\n" +
                    "That for this princess so fair\n" +
                    "He would any perils dare,\n" +
                    "Sacrifice his very soul,\n" +
                    "Barefoot, walk right to the pole.\n" +
                    "Sighing thoughtfully, the swan\n" +
                    "Murmured: \"Why so far, Guidon?\n" +
                    "Know, your future bride is here–\n" +
                    "I am that princess, my dear.\"\n" +
                    "Then she spread her wings, to soar\n" +
                    "O'er the waves towards the shore.\n" +
                    "There, amid a clump of trees,\n" +
                    "Folded them with graceful ease,\n" +
                    "Shook herself, and then and there\n" +
                    "Turned into a maiden fair–\n" +
                    "In her braids, a crescent beamed,\n" +
                    "On her brow, a bright star gleamed;\n" +
                    "She was sweet in form and face,\n" +
                    "Full of majesty and grace.\n" +
                    "When she spoke, her sweet voice seemed\n" +
                    "Like the flow of tinkling streams.\n" +
                    "He embraced the fair princess,\n" +
                    "Folded her unto his breast.\n" +
                    "Hand in hand with her he sped\n" +
                    "To his mother dear, and said,\n" +
                    "Falling on his bended knees:\n" +
                    "\"Mother darling– if you please,\n" +
                    "I have chosen me a bride–\n" +
                    "She will be your love and pride,\n" +
                    "Your consent we crave to wed,\n" +
                    "And your blessing, too,\" he said–\n" +
                    "\"Bless our marriage, so that we\n" +
                    "Live in love and harmony.\"\n" +
                    "O'er the kneeling pair, she stands,\n" +
                    "Holy icon in her hands,\n" +
                    "Smiling through her happy tears,\n" +
                    "Saying: \"God bless you, my dears.\"\n" +
                    "Prince Guidon did not delay–\n" +
                    "They were married that same day,\n" +
                    "Settled down, a happy pair,\n" +
                    "Lacking nothing but an heir.\n" +
                    "\n" +
                    "Breezes o'er the ocean play,\n" +
                    "Speed a barque upon its way;\n" +
                    "Sails all spread, it skims the seas,\n" +
                    "Running swiftly 'fore the breeze,\n" +
                    "Past a craggy island, where\n" +
                    "Stands a city proud and fair.\n" +
                    "Cannons with a mighty roar\n" +
                    "Bid the merchants put to shore,\n" +
                    "When the merchants land, Guidon\n" +
                    "Bids them be his guests anon;\n" +
                    "Feasts them first with meat and wine,\n" +
                    "Then he says: \"Now, masters mine–\n" +
                    "Tell me what you have for sale,\n" +
                    "Whither bound and whence you hail?\"\n" +
                    "Said the merchants: \"If you please,\n" +
                    "We have sailed the seven seas,\n" +
                    "Contraband, prince, was our ware,\n" +
                    "And our profits– rich and rare,\n" +
                    "We have far to travel yet–\n" +
                    "Homewards– East– our course is set,\n" +
                    "Past the Island of Buyan,\n" +
                    "Back to gracious Tsar Saltan.\"\n" +
                    "\"Gentles,\" murmured Prince Guidon–\n" +
                    "\"May fair breezes speed you on,\n" +
                    "O'er the ocean, o'er the main,\n" +
                    "Back to Tsar Saltan again.\n" +
                    "Pray remind your tsar from me,\n" +
                    "That his gracious majesty\n" +
                    "Said he'd visit us some day:\n" +
                    "We regret his long delay.\n" +
                    "Give him my regards.\" Thereon\n" +
                    "Off the merchants went. Guidon\n" +
                    "This time stayed with his fair bride,\n" +
                    "Never more to leave her side.\n" +
                    "\n" +
                    "Merrily the breeze is singing,\n" +
                    "O'er the waves a ship is winging\n" +
                    "Past the Island of Buyan\n" +
                    "To the realm of Tsar Saltan.\n" +
                    "Now his longed-for land, so dear,\n" +
                    "Stands out in the distance, clear.\n" +
                    "Now each merchant is the guest\n" +
                    "Of the tsar, by his behest.\n" +
                    "On his royal throne of state,\n" +
                    "Crowned in glory, there he sate,\n" +
                    "While the royal cook, and weaver,\n" +
                    "And their mother, sly deceiver,\n" +
                    "With four eyes, though they be three,\n" +
                    "Stared at him voraciously.\n" +
                    "Tsar Saltan, with royal grace,\n" +
                    "Gave the merchants each his place.\n" +
                    "Then he said: \"Now, masters mine–\n" +
                    "Sailed you far across the brine?\n" +
                    "Are things well where you have been?\n" +
                    "What strange wonders have you seen?\"\n" +
                    "Quoth the merchants: \"If you please,\n" +
                    "We have sailed the seven seas.\n" +
                    "Peace reigns overseas, serene.\n" +
                    "There, we saw this wondrous scene:\n" +
                    "On an island, far away,\n" +
                    "Stands a city grand and gay–\n" +
                    "Churches tall with golden domes,\n" +
                    "Gardens green, and stately homes.\n" +
                    "Near its palace grows a fir\n" +
                    "In whose shade, O royal sir,\n" +
                    "Stands a crystal house; and there\n" +
                    "Dwells a squirrel strange and rare,\n" +
                    "Full of frolic; all day long,\n" +
                    "Cracking nuts, its sings a song.\n" +
                    "Nuts, most wondrous to bekold–\n" +
                    "Shells of purest yellow gold,\n" +
                    "All its kernels– emeralds bright.\n" +
                    "Sentries guard it day and night.\n" +
                    "There we saw another wonder–\n" +
                    "Every morn, the breakers thunder\n" +
                    "And the waves, with mighty roar,\n" +
                    "Overflow the barren shore,\n" +
                    "Leaving, wonderful to see,\n" +
                    "Thirty stalwart knights and three.\n" +
                    "Each one brave beyond compare,\n" +
                    "Tall of stature, young and fair.\n" +
                    "All in mail a-gleaming bright,\n" +
                    "Marching proudly left and right:\n" +
                    "All alike beyond belief,\n" +
                    "Led by Chernomor, their chief.\n" +
                    "Nor will you find guards so true,\n" +
                    "Vigilant and fearless, too.\n" +
                    "Prince Guidon reigns there in glory,\n" +
                    "He is praised in song and story.\n" +
                    "And his wife is fair, O sire–\n" +
                    "Gaze on her–you'll never tire.\n" +
                    "Brighter than the sun at noon,\n" +
                    "She outshines the midnight moon;\n" +
                    "In her braids, a crescent beams,\n" +
                    "On her brow, a bright star gleams.\n" +
                    "Prince Guidon sends his respects,\n" +
                    "Bade us say he still expects\n" +
                    "You to visit him one day\n" +
                    "And regrets your long delay.\"\n" +
                    "\n" +
                    "All impatient, Tsar Saltan\n" +
                    "Gave command his fleet to man,\n" +
                    "But the royal cook, and weaver,\n" +
                    "And their mother, sly deceiver,\n" +
                    "Did their best to keep their tsar\n" +
                    "From this wondrous isle so far.\n" +
                    "He, to their persuasions deaf,\n" +
                    "Bade the women hold their breath.\n" +
                    "\"I'm your tsar and not a child!\"\n" +
                    "Shouted he in passion wild–\n" +
                    "\"We will sail today. No more!\"\n" +
                    "Stamped his foot and slammed the door.\n" +
                    "\n" +
                    "From his casement, silently,\n" +
                    "Prince Guidon gazed at the sea.\n" +
                    "Scarce a ripple stirred the deep\n" +
                    "As it sighed as though in sleep.\n" +
                    "On the far horizon blue\n" +
                    "Sails came one by one in view.\n" +
                    "Tsar Saltan's fleet, at long last,\n" +
                    "O'er the seas was sailing fast.\n" +
                    "At this sight, Guidon rushed out,\n" +
                    "Uttering a mighty shout:\n" +
                    "\"Mother dear, come hither, do–\n" +
                    "You, my fair princess, come too–\n" +
                    "Only look out yonder–there\n" +
                    "Sails my father, I declare!\"\n" +
                    "Through his spyglass, Prince Guidon\n" +
                    "Sees the royal fleet sail on;\n" +
                    "While on deck, his father stands,\n" +
                    "Spyglass also in his hands.\n" +
                    "With him are the cook, and weaver,\n" +
                    "And their mother, sly deceiver;\n" +
                    "Wonder in their gaze, they stare\n" +
                    "At this isle so strange and fair.\n" +
                    "In salute the cannons roared,\n" +
                    "Carols sweet from belfries soared.\n" +
                    "To the shore Guidon then ran,\n" +
                    "There to welcome Tsar Saltan,\n" +
                    "And the royal cook, and weaver,\n" +
                    "And their mother, sly deceiver.\n" +
                    "Citywards the tsar led he–\n" +
                    "Not a single word said he.\n" +
                    "\n" +
                    "Now the palace came in sight,\n" +
                    "Sentries, clad in armor bright.\n" +
                    "Tsar Saltan looked on to see\n" +
                    "Thirty stalwart knights and three–\n" +
                    "Each one brave beyond compare,\n" +
                    "Tall of stature, young and fair,\n" +
                    "All alike beyond belief,\n" +
                    "Led by Chernomor, their chief.\n" +
                    "Then he reached the courtyard wide,\n" +
                    "Where a lofty fir he spied.\n" +
                    "In its shadow–lo, behold,\n" +
                    "Cracking nuts of solid gold,\n" +
                    "Sat a little squirrel, singing,\n" +
                    "Emeralds into sacklets flinging.\n" +
                    "Golden nutshells lay around\n" +
                    "On the spacious courtyard ground.\n" +
                    "Further on the guests now press,\n" +
                    "Meet the wonderful princess:\n" +
                    "In her braids, a crescent beams,\n" +
                    "On her brow, a bright star gleams;\n" +
                    "She is sweet of form and face,\n" +
                    "Full of majesty and grace,\n" +
                    "Tsar Saltan's own wife beside her.\n" +
                    "He gazed on and recognized her.\n" +
                    "And his heart began to leap,\n" +
                    "\"Am I dreaming in my sleep?\"\n" +
                    "Gasped the tsar in stark surprise,\n" +
                    "Tears a-streaming from his eyes,\n" +
                    "He embraced his wife in pride,\n" +
                    "Kissed his son, his son's fair bride;\n" +
                    "Then they all sat down to feast\n" +
                    "Where their laughter never ceased,\n" +
                    "While the cook, and royal weaver,\n" +
                    "And their mother, sly deceiver,\n" +
                    "Fled and hid beneath the stairs\n" +
                    "But were dragged out by their hairs.\n" +
                    "Weeping, each her crimes confessed,\n" +
                    "Begged forgiveness, beat her breast.\n" +
                    "So the tsar, in his great glee\n" +
                    "Sent them home across the sea,\n" +
                    "Late at night, with tipsy head,\n" +
                    "Tsar Saltan was put to bed.\n" +
                    "I drank beer and mead there–yet\n" +
                    "Only got my whiskers wet.";


            editText.setText(mainInfo);

            animate(transl);

        }
        // Capture the layout's TextView and set the string as its text


    }

    public void translate (View view){

    }
}
